[
    {
      "section_number": "22",
      "title": "Basis of charge on House Property income",
      "keywords": ["Income from House Property"],
      "raw_text": "The annual value of property consisting of any buildings or lands appurtenant thereto of which the assessee is the owner, other than such portions of such property as he may occupy for the purposes of any business or profession carried on by him the profits of which are chargeable to income-tax, shall be charge­able to income-tax under the head Income from house property"
    },

    {
      "section_number": "23",
      "title": "Annual Value - Computation for House Property",
      "keywords": ["house property", "annual value", "vacant property", "self-occupied", "rental income", "section 23"],
      "raw_text": "Section 23 determines the annual value of property for the purposes of income under house property. \n\n(1) For the purposes of section 22, the annual value of any property shall be deemed to be—\n(a) the sum for which the property might reasonably be expected to let from year to year; or\n(b) where the property or any part of the property is let and the actual rent received or receivable by the owner in respect thereof is in excess of the sum referred to in clause (a), the amount so received or receivable; or\n(c) where the property or any part of the property is let and was vacant during the whole or any part of the previous year and owing to such vacancy the actual rent received or receivable by the owner in respect thereof is less than the sum referred to in clause (a), the amount so received or receivable:\nProvided that the taxes levied by any local authority in respect of the property shall be deducted (irrespective of the previous year in which the liability to pay such taxes was incurred by the owner according to the method of accounting regularly employed by him) in determining the annual value of the property of that previous year in which such taxes are actually paid by him.\nExplanation.—For the purposes of clause (b) or clause (c) of this sub-section, the amount of actual rent received or receivable by the owner shall not include, subject to such rules as may be made in this behalf, the amount of rent which the owner cannot realise.\n\n(2) Where the property consists of a house or part of a house which—\n(a) is in the occupation of the owner for the purposes of his own residence; or\n(b) cannot actually be occupied by the owner by reason of the fact that owing to his employment, business or profession carried on at any other place, he has to reside at that other place in a building not belonging to him,\nthe annual value of such house or part of the house shall be taken to be nil.\n\n(3) The provisions of sub-section (2) shall not apply if—\n(a) the house or part of the house is actually let during the whole or any part of the previous year; or\n(b) any other benefit therefrom is derived by the owner.\n\n(4) Where the property referred to in sub-section (2) consists of more than two houses—\n(a) the provisions of that sub-section shall apply only in respect of two of such houses, which the assessee may, at his option, specify in this behalf;\n(b) the annual value of the house or houses, other than the house or houses in respect of which the assessee has exercised an option under clause (a), shall be determined under sub-section (1) as if such house or houses had been let.\n\n(5) Where the property consisting of any building or land appurtenant thereto is held as stock-in-trade and the property or any part of the property is not let during the whole or any part of the previous year, the annual value of such property or part of the property, for the period up to two years from the end of the financial year in which the certificate of completion of construction of the property is obtained from the competent authority, shall be taken to be nil." 
      },

      {
        "section_number": "24",
        "title": "Deductions from income from house property",
        "keywords": ["house property", "deduction", "interest", "home loan", "borrowed capital", "section 24", "₹2 lakh", "30% standard deduction", "interest on housing loan", "pre-construction interest"],
        "raw_text": "Section 24. Income chargeable under the head \"Income from house property\" shall be computed after making the following deductions, namely:\n\n(a) a sum equal to thirty per cent of the annual value;\n\n(b) where the property has been acquired, constructed, repaired, renewed or reconstructed with borrowed capital, the amount of any interest payable on such capital:\n\nProvided that in respect of property referred to in sub-section (2) of section 23, the amount of deduction or, as the case may be, the aggregate of the amount of deduction shall not exceed thirty thousand rupees:\n\nProvided further that where the property referred to in the first proviso is acquired or constructed with capital borrowed on or after the 1st day of April, 1999 and such acquisition or construction is completed within five years from the end of the financial year in which capital was borrowed, the amount of deduction or, as the case may be, the aggregate of the amounts of deduction under this clause shall not exceed two lakh rupees.\n\nExplanation.—Where the property has been acquired or constructed with borrowed capital, the interest, if any, payable on such capital borrowed for the period prior to the previous year in which the property has been acquired or constructed, as reduced by any part thereof allowed as deduction under any other provision of this Act, shall be deducted under this clause in equal instalments for the said previous year and for each of the four immediately succeeding previous years:\n\nProvided also that no deduction shall be made under the second proviso unless the assessee furnishes a certificate, from the person to whom any interest is payable on the capital borrowed, specifying the amount of interest payable by the assessee for the purpose of such acquisition or construction of the property, or, conversion of the whole or any part of the capital borrowed which remains to be repaid as a new loan.\n\nExplanation.—For the purposes of this proviso, the expression \"new loan\" means the whole or any part of a loan taken by the assessee subsequent to the capital borrowed, for the purpose of repayment of such capital:\n\nProvided also that the aggregate of the amounts of deduction under the first and second provisos shall not exceed two lakh rupees."
      },

      {
        "section_number": "25",
        "title": "Disallowance of interest paid outside India on which tax not deducted",
        "keywords": ["house property", "interest disallowed", "foreign loan", "tax not deducted", "section 25", "non-resident", "agent under section 163", "Chapter XVII-B"],
        "raw_text": "Section 25. Notwithstanding anything contained in section 24, any interest chargeable under this Act which is payable outside India (not being interest on a loan issued for public subscription before the 1st day of April, 1938), on which tax has not been paid or deducted under Chapter XVII-B and in respect of which there is no person in India who may be treated as an agent under section 163 shall not be deducted in computing the income chargeable under the head \"Income from house property\"."
      },

      {
        "section_number": "25A",
        "title": "Special provision for arrears of rent and unrealised rent received subsequently",
        "keywords": ["house property", "arrears of rent", "unrealised rent", "30% deduction", "received rent", "deemed income", "section 25A"],
        "raw_text": "Section 25A. (1) The amount of arrears of rent received from a tenant or the unrealised rent realised subsequently from a tenant, as the case may be, by an assessee shall be deemed to be the income from house property in respect of the financial year in which such rent is received or realised, and shall be included in the total income of the assessee under the head \"Income from house property\", whether the assessee is the owner of the property or not in that financial year.\n\n(2) A sum equal to thirty per cent of the arrears of rent or the unrealised rent referred to in sub-section (1) shall be allowed as deduction."
      },

      {
        "section_number": "26",
        "title": "Property owned by co-owners",
        "keywords": ["house property", "co-owners", "AOP", "definite shares", "income distribution", "section 26", "ownership", "multiple owners", "sub-section 2 of section 23"],
        "raw_text": "Section 26. Where property consisting of buildings or buildings and lands appurtenant thereto is owned by two or more persons and their respective shares are definite and ascertainable, such persons shall not in respect of such property be assessed as an association of persons, but the share of each such person in the income from the property as computed in accordance with sections 22 to 25 shall be included in his total income.\n\nExplanation.—For the purposes of this section, in applying the provisions of sub-section (2) of section 23 for computing the share of each such person as is referred to in this section, such share shall be computed, as if each such person is individually entitled to the relief provided in that sub-section."
      },

      {
        "section_number": "27",
        "title": "\"Owner of house property\", \"annual charge\", etc., defined",
        "keywords": ["deemed owner", "house property", "section 27", "spouse transfer", "minor child", "impartible estate", "co-operative society", "Transfer of Property Act", "269UA", "local taxes", "ownership rules"],
        "raw_text": "Section 27. For the purposes of sections 22 to 26—\n\n(i) an individual who transfers otherwise than for adequate consideration any house property to his or her spouse, not being a transfer in connection with an agreement to live apart, or to a minor child not being a married daughter, shall be deemed to be the owner of the house property so transferred;\n\n(ii) the holder of an impartible estate shall be deemed to be the individual owner of all the properties comprised in the estate;\n\n(iii) a member of a co-operative society, company or other association of persons to whom a building or part thereof is allotted or leased under a house building scheme of the society, company or association, as the case may be, shall be deemed to be the owner of that building or part thereof;\n\n(iiia) a person who is allowed to take or retain possession of any building or part thereof in part performance of a contract of the nature referred to in section 53A of the Transfer of Property Act, 1882 (4 of 1882), shall be deemed to be the owner of that building or part thereof;\n\n(iiib) a person who acquires any rights (excluding any rights by way of a lease from month to month or for a period not exceeding one year) in or with respect to any building or part thereof, by virtue of any such transaction as is referred to in clause (f) of section 269UA, shall be deemed to be the owner of that building or part thereof;\n\n(iv) [***]\n\n(v) [***]\n\n(vi) taxes levied by a local authority in respect of any property shall be deemed to include service taxes levied by the local authority in respect of the property."
      },

      {
        "section_number": "28",
        "title": "Income chargeable under the head 'Profits and Gains of Business or Profession'",
        "keywords": [
          "business income",
          "professional income",
          "compensation",
          "keyman insurance",
          "benefits or perquisites",
          "inventory conversion",
          "termination compensation",
          "exports",
          "section 28",
          "PGBP"
        ],
        "raw_text": "Section 28. The following income shall be chargeable to income-tax under the head 'Profits and Gains of Business or Profession':\n\n(i) Profits and gains of any business or profession carried on by the assessee during the previous year.\n\n(ii) Compensation or other payments received by key managerial personnel or agents at the time of termination/modification of terms.\n\n(iii) Income earned by trade, professional or similar associations for specific services to members.\n\n(iiia - iiie) Export-related profits such as licence sale, cash assistance, duty drawbacks, Duty Entitlement Pass Book Scheme, and Duty Free Replenishment Certificate.\n\n(iv) Value of any benefit or perquisite from business or profession (cash or kind).\n\n(v) Interest, salary, commission or bonus received by a partner from a firm (subject to disallowance adjustments under section 40).\n\n(va) Any sum received under an agreement to not carry out a business activity or not share intellectual property.\n\n(vi) Sum received under a Keyman Insurance Policy.\n\n(via) Fair market value of inventory converted into capital assets.\n\n(vii) Compensation for damaged/demolished business assets if deduction under section 35AD was allowed.\n\nExplanation 2: Speculative business shall be treated as separate and distinct from other businesses.\n\nExplanation 3 (Applicable from AY 2025–26): Income from letting out of residential house or part thereof shall not be taxable under PGBP, but under 'Income from House Property'."
      },

      {
        "section_number": "30",
        "title": "Rent, rates, taxes, repairs and insurance for buildings",
        "keywords": [
          "rent deduction",
          "repairs deduction",
          "insurance premium",
          "municipal taxes",
          "current repairs",
          "business premises",
          "local rates",
          "land revenue",
          "section 30",
          "PGBP"
        ],
        "raw_text": "Section 30. In respect of rent, rates, taxes, repairs and insurance for premises used for business or profession, the following deductions shall be allowed:\n\n(a) Where the premises are occupied by the assessee—\n  (i) As a tenant, the rent paid and, if agreed, the cost of repairs borne by the tenant;\n  (ii) As an owner, the amount spent on current repairs to the premises.\n\n(b) Any amount paid as land revenue, local rates, or municipal taxes.\n\n(c) Insurance premium paid against risk of damage or destruction of premises.\n\nExplanation: Expenses on repairs under clause (a) shall not include capital expenditure."
      },

      {
        "section_number": "31",
        "title": "Repairs and insurance of machinery, plant, or furniture used for business or profession",
        "keywords": [
          "repairs",
          "insurance",
          "machinery",
          "plant",
          "furniture",
          "business expenses",
          "capital expenditure",
          "current repairs",
          "insurance premium"
        ],
        "raw_text": "Section 31. In respect of repairs and insurance of machinery, plant or furniture used for the purposes of the business or profession, the following deductions shall be allowed—\n\n(i) the amount paid on account of current repairs thereto;\n\n(ii) the amount of any premium paid in respect of insurance against risk of damage or destruction thereof.\n\nExplanation.—For the removal of doubts, it is hereby declared that the amount paid on account of current repairs shall not include any expenditure in the nature of capital expenditure."
      },

      {
        "section_number": "32",
        "title": "Depreciation",
        "keywords": [
          "depreciation",
          "tangible assets",
          "intangible assets",
          "block of assets",
          "written down value",
          "capital expenditure",
          "commercial vehicle",
          "motor car",
          "business rights",
          "industrial property"
        ],
        "raw_text": "Section 32. (1) In respect of depreciation of—\n\n(i) buildings, machinery, plant or furniture, being tangible assets;\n\n(ii) know-how, patents, copyrights, trade marks, licences, franchises or any other business or commercial rights of similar nature, being intangible assets acquired on or after the 1st day of April, 1998, not being goodwill of a business or profession,\n\nowned, wholly or partly, by the assessee and used for the purposes of the business or profession, the following deductions shall be allowed—\n\n(i) in the case of assets of an undertaking engaged in generation or generation and distribution of power, such percentage on the actual cost thereof to the assessee as may be prescribed;\n\n(ii) in the case of any block of assets, such percentage on the written down value thereof as may be prescribed:\n\nProvided that no deduction shall be allowed under this clause in respect of—\n\n(a) any motor car manufactured outside India, where such motor car is acquired by the assessee after the 28th day of February, 1975 but before the 1st day of April, 2001, unless it is used—\n\n(i) in a business of running it on hire for tourists;\n\n(ii) outside India in his business or profession in another country;\n\n(b) any machinery or plant if the actual cost thereof is allowed as a deduction in one or more years under an agreement entered into by the Central Government under section 42;\n\nProvided further that where an asset referred to in clause (i) or clause (ii) or clause (iia) or the first proviso to clause (iia), as the case may be, is acquired by the assessee during the previous year and is put to use for the purposes of business or profession for a period of less than one hundred and eighty days in that previous year, the deduction under this sub-section in respect of such asset shall be restricted to fifty per cent of the amount calculated at the percentage prescribed for an asset under clause (i) or clause (ii) or clause (iia), as the case may be:\n\nProvided also that where an asset referred to in clause (iia) or the first proviso to clause (iia), as the case may be, is acquired by the assessee during the previous year and is put to use for the purposes of business for a period of less than one hundred and eighty days in that previous year, and the deduction under this sub-section in respect of such asset is restricted to fifty per cent of the amount calculated at the percentage prescribed for an asset under clause (iia) for that previous year, then, the deduction for the balance fifty per cent of the amount calculated at the percentage prescribed for such asset under clause (iia) shall be allowed under this sub-section in the immediately succeeding previous year in respect of such asset:\n\nProvided also that where an asset being commercial vehicle is acquired by the assessee on or after the 1st day of October, 1998 but before the 1st day of April, 1999 and is put to use before the 1st day of April, 1999 for the purposes of business or profession, the deduction in respect of such asset shall be allowed on such percentage on the written down value thereof as may be prescribed.\n\nExplanation.—For the purposes of this proviso—\n\n(a) the expression \"commercial vehicle\" means \"heavy goods vehicle\", \"heavy passenger motor vehicle\", \"light motor vehicle\", \"medium goods vehicle\" and \"medium passenger motor vehicle\" but does not include \"maxi-cab\", \"motor-cab\", \"tractor\" and \"road-roller\";\n\n(b) the expressions \"heavy goods vehicle\", \"heavy passenger motor vehicle\", \"light motor vehicle\", \"medium goods vehicle\", \"medium passenger motor vehicle\", \"maxi-cab\", \"motor-cab\", \"tractor\" and \"road roller\" shall have the meanings respectively as assigned to them in section 2 of the Motor Vehicles Act, 1988 (59 of 1988);\n\nProvided also that, in respect of the previous year relevant to the assessment year commencing on the 1st day of April, 1991, the deduction in relation to any block of assets under this clause shall, in the case of a company, be restricted to seventy-five per cent of the amount calculated at the percentage, on the written down value of such assets, prescribed under this Act immediately before the commencement of the Taxation Laws (Amend­ment) Act, 1991;\n\nProvided also that the aggregate deduction, in respect of depre­ciation of buildings, machinery, plant or furniture, being tangible assets or know-how, patents, copyrights, trademarks, licences, franchises or any other business or commercial rights of similar nature, being intangible assets allowable to the predecessor and the successor in the case of succession referred to in clause (xiii), clause (xiiib) and clause (xiv) of section 47 or section 170 or to the amalgamating company and the amalgamated company in the case of amalgamation, or to the demerged company and the result­ing company in the case of demerger, as the case may be, shall not exceed in any previous year the deduction calculated at the prescribed rates as if the succession or the amalgamation or the demerger, as the case may be, had not taken place, and such deduction shall be apportioned between the predecessor and the successor, or the amalgamating company and the amalgamated compa­ny, or the demerged company and the resulting company, as the case may be, in the ratio of the number of days for which the assets were used by them.\n\nExplanation 1.—Where the business or profession of the assessee is carried on in a building not owned by him but in respect of which the assessee holds a lease or other right of occupancy and any capital expenditure is incurred by the assessee for the purposes of the business or profession on the construc­tion of any structure or doing of any work in or in relation to, and by way of renovation or extension of, or improvement to, the building, then, the provisions of this clause shall apply as if the said structure or work is a building owned by the assessee.\n\nExplanation 2.—For the purposes of this sub-section \"written down value of the block of assets\" shall have the same meaning as in clause (c) of sub-section (6) of section 43.\n\nExplanation 3.—For the purposes of this sub-section, the expression \"assets\" shall mean—\n\n(a) tangible assets, being buildings, machinery, plant or furniture;\n\n(b) intangible assets, being know-how, patents, copyrights, trade marks, licences, franchises or any other business or commercial rights of similar nature, not being goodwill of a business or profession.\n\nExplanation 4.—For the purposes of this sub-section, the expression \"know-how\" means any industrial information or technique likely to assist in the manufacture or processing of goods or in the working of a mine, oil-well or other sources of mineral deposits (including searching for discovery or testing of deposits for the winning of access thereto).\n\nExplanation 5.—For the removal of doubts, it is hereby declared that the provisions of this sub-section shall apply whether or not the assessee has claimed the deduction in respect of depreciation in computing his total income;\n\n(iia) in the case of any new machinery or plant (other than ships and aircraft), which has been acquired and installed after the 31st day of March, 2005, by an assessee engaged in the business of manufacture or production of any article or thing or in the business of generation, transmission or distribution of power, a further sum equal to twenty per cent of the actual cost of such machinery or plant shall be allowed as deduction under clause (ii) :\n\nProvided that where an assessee, sets up an undertaking or enterprise for manufacture or production of any article or thing, on or after the 1st day of April, 2015 in any backward area notified by the Central Government in this behalf, in the State of Andhra Pradesh or in the State of Bihar or in the State of Telangana or in the State of West Bengal, and acquires and installs any new machinery or plant (other than ships and aircraft) for the purposes of the said undertaking or enterprise during the period beginning on the 1st day of April, 2015 and ending before the 1st day of April, 2020 in the said backward area, then, the provisions of clause (iia) shall have effect, as if for the words \"twenty per cent\", the words \"thirty-five per cent\" had been substituted :\n\nProvided further that no deduction shall be allowed in respect of—\n\n(A) any machinery or plant which, before its installation by the assessee, was used either within or outside India by any other person; or\n\n(B) any machinery or plant installed in any office premises or any residential accommodation, including accommodation in the nature of a guest-house; or\n\n(C) any office appliances or road transport vehicles; or\n\n(D) any machinery or plant, the whole of the actual cost of which is allowed as a deduction (whether by way of depreciation or otherwise) in computing the income of the assessee under any other provision of this Act.",
        "metadata": {
          "subsections": [
            {
              "subsection_number": "32(1)",
              "title": "Depreciation on tangible and intangible assets",
              "keywords": [
                "block of assets",
                "written down value",
                "commercial vehicle",
                "motor car"
              ],
              "text_summary": "Depreciation allowed on tangible and intangible assets used for business or profession, with specific rules for motor vehicles and machinery."
            },
            {
              "subsection_number": "32(2)",
              "title": "Explanation on WDV (Written Down Value)",
              "keywords": [
                "WDV",
                "block of assets"
              ],
              "text_summary": "Explanation on how written down value is calculated and used for depreciation purposes."
            }
          ]
        }
      },

      {
        "section_number": "32AC",
        "title": "Investment in New Plant or Machinery",
        "text": "32AC. (1) Where an assessee, being a company, engaged in the business of manufacture or production of any article or thing, acquires and installs new asset after the 31st day of March, 2013 but before the 1st day of April, 2015 and the aggregate amount of actual cost of such new assets exceeds one hundred crore rupees, then, there shall be allowed a deduction,—\n\n(a) for the assessment year commencing on the 1st day of April, 2014, of a sum equal to fifteen per cent of the actual cost of new assets acquired and installed after the 31st day of March, 2013 but before the 1st day of April, 2014, if the aggregate amount of actual cost of such new assets exceeds one hundred crore rupees; and\n\n(b) for the assessment year commencing on the 1st day of April, 2015, of a sum equal to fifteen per cent of the actual cost of new assets acquired and installed after the 31st day of March, 2013 but before the 1st day of April, 2015, as reduced by the amount of deduction allowed, if any, under clause (a).\n\n(1A) Where an assessee, being a company, engaged in the business of manufacture or production of any article or thing, acquires and installs new assets and the amount of actual cost of such new assets acquired during any previous year exceeds twenty-five crore rupees and such assets are installed on or before the 31st day of March, 2017, then, there shall be allowed a deduction of a sum equal to fifteen per cent of the actual cost of such new assets for the assessment year relevant to that previous year:\n\nProvided that where the installation of the new assets are in a year other than the year of acquisition, the deduction under this sub-section shall be allowed in the year in which the new assets are installed:\n\nProvided further that no deduction under this sub-section shall be allowed for the assessment year commencing on the 1st day of April, 2015 to the assessee, which is eligible to claim deduction under sub-section (1) for the said assessment year.\n\n(1B) No deduction under sub-section (1A) shall be allowed for any assessment year commencing on or after the 1st day of April, 2018.\n\n(2) If any new asset acquired and installed by the assessee is sold or otherwise transferred, except in connection with the amalgamation or demerger, within a period of five years from the date of its installation, the amount of deduction allowed under sub-section (1) or sub-section (1A) in respect of such new asset shall be deemed to be the income of the assessee chargeable under the head 'Profits and gains of business or profession' of the previous year in which such new asset is sold or otherwise transferred, in addition to taxability of gains, arising on account of transfer of such new asset.\n\n(3) Where the new asset is sold or otherwise transferred in connection with the amalgamation or demerger within a period of five years from the date of its installation, the provisions of sub-section (2) shall apply to the amalgamated company or the resulting company, as the case may be, as they would have applied to the amalgamating company or the demerged company.\n\n(4) For the purposes of this section, 'new asset' means any new plant or machinery (other than ship or aircraft) but does not include—\n\n(i) any plant or machinery which before its installation by the assessee was used either within or outside India by any other person;\n\n(ii) any plant or machinery installed in any office premises or any residential accommodation, including accommodation in the nature of a guest house;\n\n(iii) any office appliances including computers or computer software;\n\n(iv) any vehicle; or\n\n(v) any plant or machinery, the whole of the actual cost of which is allowed as deduction (whether by way of depreciation or otherwise) in computing the income chargeable under the head 'Profits and gains of business or profession' of any previous year.",
        "metadata": {
          "subsections": [
            {
              "subsection_number": "32AC(1)",
              "title": "Deduction for New Assets (Acquired and Installed)",
              "keywords": [
                "deduction",
                "new asset",
                "company",
                "manufacture",
                "production",
                "hundred crore",
                "actual cost",
                "assessment year"
              ],
              "text_summary": "This subsection allows a deduction for the acquisition and installation of new assets for companies engaged in manufacturing or production. Deduction is allowed based on the aggregate cost exceeding one hundred crore rupees."
            },
            {
              "subsection_number": "32AC(1A)",
              "title": "Deduction for Assets Acquired Between 2013–2017",
              "keywords": [
                "deduction",
                "new asset",
                "manufacturing company",
                "twenty-five crore",
                "installation"
              ],
              "text_summary": "For assets acquired and installed by companies with an actual cost exceeding twenty-five crore rupees between 2013 and 2017, a fifteen percent deduction is allowed for the relevant assessment year."
            },
            {
              "subsection_number": "32AC(1B)",
              "title": "No Deduction Post-April 2018",
              "keywords": [
                "no deduction",
                "after 2018"
              ],
              "text_summary": "This subsection disallows deductions for any new assets acquired after April 2018."
            },
            {
              "subsection_number": "32AC(2)",
              "title": "Income on Transfer of New Asset Within Five Years",
              "keywords": [
                "transfer",
                "five years",
                "deduction",
                "income",
                "business"
              ],
              "text_summary": "If a new asset is transferred within five years, the deduction granted will be added to the taxable income in the year of sale or transfer."
            },
            {
              "subsection_number": "32AC(3)",
              "title": "Amalgamation or Demerger",
              "keywords": [
                "amalgamation",
                "demerger",
                "new asset",
                "five years"
              ],
              "text_summary": "If assets are sold during an amalgamation or demerger, the deduction is transferred to the resulting company."
            },
            {
              "subsection_number": "32AC(4)",
              "title": "Definition of New Asset",
              "keywords": [
                "new asset",
                "plant",
                "machinery",
                "exclusions"
              ],
              "text_summary": "This subsection defines 'new asset' and lists exclusions such as office appliances, vehicles, and assets already claimed for deductions."
            }
          ]
        }
      },

      {
        "section_number": "35CCC",
        "title": "Expenditure on Agricultural Extension Project",
        "text": "35CCC. (1) Where an assessee incurs any expenditure on agricultural extension project notified by the Board in this behalf in accordance with the guidelines as may be prescribed, then, there shall be allowed a deduction of a sum equal to one and one-half times of such expenditure :\n\nProvided that for the assessment year beginning on or after the 1st day of April, 2021, the provisions of this sub-section shall have effect as if for the words 'a sum equal to one and one-half times of', the words 'a sum equal to' had been substituted.\n\n(2) Where a deduction under this section is claimed and allowed for any assessment year in respect of any expenditure referred to in sub-section (1), deduction shall not be allowed in respect of such expenditure under any other provisions of this Act for the same or any other assessment year.",
        "metadata": {
          "subsections": [
            {
              "subsection_number": "35CCC(1)",
              "title": "Deduction for Agricultural Extension Project Expenditure",
              "keywords": [
                "agricultural extension",
                "deduction",
                "expenditure",
                "one and one-half times",
                "Board notification",
                "guidelines",
                "assessment year"
              ],
              "text_summary": "This subsection allows a deduction equal to one and a half times of the expenditure incurred on agricultural extension projects, with an exception for assessment years after April 2021 where the deduction is equal to the actual expenditure."
            },
            {
              "subsection_number": "35CCC(2)",
              "title": "Exclusivity of Deduction",
              "keywords": [
                "deduction",
                "no double claim",
                "same expenditure",
                "other provisions"
              ],
              "text_summary": "This subsection ensures that if a deduction is claimed under this section, it cannot be claimed again under any other provisions of the Act for the same or any other assessment year."
            }
          ]
        }
      },

      {
        "section_number": "35D",
        "title": "Amortisation of Certain Preliminary Expenses",
        "text": "35D. (1) Where an assessee, being an Indian company or a person (other than a company) who is resident in India, incurs, after the 31st day of March, 1970, any expenditure specified in sub-section (2),—\n\n(i) before the commencement of his business, or\n\n(ii) after the commencement of his business, in connection with the extension of his undertaking or in connection with his setting up a new unit,\n\nthe assessee shall, in accordance with and subject to the provisions of this section, be allowed a deduction of an amount equal to one-tenth of such expenditure for each of the ten successive previous years beginning with the previous year in which the business commences or, as the case may be, the previous year in which the extension of the undertaking is completed or the new unit commences production or operation :\n\nProvided that where an assessee incurs after the 31st day of March, 1998, any expenditure specified in sub-section (2), the provisions of this sub-section shall have effect as if for the words 'an amount equal to one-tenth of such expenditure for each of the ten successive previous years', the words 'an amount equal to one-fifth of such expenditure for each of the five successive previous years' had been substituted.\n\n(2) The expenditure referred to in sub-section (1) shall be the expenditure specified in any one or more of the following clauses, namely :—\n\n(a) expenditure in connection with—\n\n(i) preparation of feasibility report;\n\n(ii) preparation of project report;\n\n(iii) conducting market survey or any other survey necessary for the business of the assessee;\n\n(iv) engineering services relating to the business of the assessee :\n\n20[Provided that the assessee shall furnish a statement containing the particulars of expenditure specified in this clause within such period, to such income-tax authority, in such form and manner, as may be prescribed;]\n\n(b) legal charges for drafting any agreement between the assessee and any other person for any purpose relating to the setting up or conduct of the business of the assessee;\n\n(c) where the assessee is a company, also expenditure—\n\n(i) by way of legal charges for drafting the Memorandum and Articles of Association of the company;\n\n(ii) on printing of the Memorandum and Articles of Association;\n\n(iii) by way of fees for registering the company under the provisions of the Companies Act, 1956 (1 of 1956);\n\n(iv) in connection with the issue, for public subscription, of shares in or debentures of the company, being underwriting commission, brokerage and charges for drafting, typing, printing and advertisement of the prospectus;\n\n(d) such other items of expenditure (not being expenditure eligible for any allowance or deduction under any other provision of this Act) as may be prescribed.\n\n(3) Where the aggregate amount of the expenditure referred to in sub-section (2) exceeds an amount calculated at two and one-half per cent—\n\n(a) of the cost of the project, or\n\n(b) where the assessee is an Indian company, at the option of the company, of the capital employed in the business of the company,\nthe excess shall be ignored for the purpose of computing the deduction allowable under sub-section (1) :\n\nProvided that where the aggregate amount of expenditure referred to in sub-section (2) is incurred after the 31st day of March, 1998, the provisions of this sub-section shall have effect as if for the words 'two and one-half per cent', the words 'five per cent' had been substituted.\n\nExplanation.—In this sub-section—\n\n(a) \"cost of the project\" means—\n\n(i) in a case referred to in clause (i) of sub-section (1), the actual cost of the fixed assets, being land, buildings, leaseholds, plant, machinery, furniture, fittings and railway sidings (including expenditure on development of land and buildings), which are shown in the books of the assessee as on the last day of the previous year in which the business of the assessee commences;\n\n(ii) in a case referred to in clause (ii) of sub-section (1), the actual cost of the fixed assets, being land, buildings, leaseholds, plant, machinery, furniture, fittings and railway sidings (including expenditure on development of land and buildings), which are shown in the books of the assessee as on the last day of the previous year in which the extension of the undertaking is completed or, as the case may be, the new unit commences production or operation, in so far as such fixed assets have been acquired or developed in connection with the extension of the undertaking or the setting up of the new unit of the assessee;\n\n(b) \"capital employed in the business of the company\" means—\n\n(i) in a case referred to in clause (i) of sub-section (1), the aggregate of the issued share capital, debentures and long-term borrowings as on the last day of the previous year in which the business of the company commences;\n\n(ii) in a case referred to in clause (ii) of sub-section (1), the aggregate of the issued share capital, debentures and long-term borrowings as on the last day of the previous year in which the extension of the undertaking is completed or, as the case may be, the new unit commences production or operation, in so far as such capital, debentures and long-term borrowings have been issued or obtained in connection with the extension of the undertaking or the setting up of the new unit of the company;\n\n(c) \"long-term borrowings\" means—\n\n(i) any moneys borrowed by the company from Government or the Industrial Finance Corporation of India or the Industrial Credit and Investment Corporation of India or any other financial institution which is eligible for deduction under clause (viii) of sub-section (1) of section 36 or any banking institution (not being a financial institution referred to above), or\n\n(ii) any moneys borrowed or debt incurred by it in a foreign country in respect of the purchase outside India of capital plant and machinery, where the terms under which such moneys are borrowed or the debt is incurred provide for the repayment thereof during a period of not less than seven years.\n\n(4) Where the assessee is a person other than a company or a co-operative society, no deduction shall be admissible under sub-section (1) unless the accounts of the assessee for the year or years in which the expenditure specified in sub-section (2) is incurred have been audited by an accountant as defined in the Explanation below sub-section (2) of section 288, before the specified date referred to in section 44AB and the assessee furnishes for the first year in which the deduction under this section is claimed, the report of such audit by that date in the prescribed form duly signed and verified by such accountant and setting forth such particulars as may be prescribed.\n\n(5) Where the undertaking of an Indian company which is entitled to the deduction under sub-section (1) is transferred, before the expiry of the period of ten years specified in sub-section (1), to another Indian company in a scheme of amalgamation,—\n\n(i) no deduction shall be admissible under sub-section (1) in the case of the amalgamating company for the previous year in which the amalgamation takes place; and\n\n(ii) the provisions of this section shall, as far as may be, apply to the amalgamated company as they would have applied to the amalgamating company if the amalgamation had not taken place.\n\n(5A) Where the undertaking of an Indian company which is entitled to the deduction under sub-section (1) is transferred, before the expiry of the period specified in sub-section (1), to another company in a scheme of demerger,—\n\n(i) no deduction shall be admissible under sub-section (1) in the case of the demerged company for the previous year in which the demerger takes place; and\n\n(ii) the provisions of this section shall, as far as may be, apply to the resulting company, as they would have applied to the demerged company, if the demerger had not taken place.\n\n(6) Where a deduction under this section is claimed and allowed for any assessment year in respect of any expenditure specified in sub-section (2), the expenditure in respect of which deduction is so allowed shall not qualify for deduction under any other provision of this Act for the same or any other assessment year."
      },

      {
        "section_36": {
          "overview": "Section 36 of the Income Tax Act, 1961, specifies deductions allowed for certain business or professional expenses, helping reduce taxable income.",
          "deductions_allowed": [
            {
              "clause": "36(1)(i)",
              "description": "Bad debts written off",
              "details": "Bad debts that are written off during the assessment year are deductible. The debts must have been previously included in the income."
            },
            {
              "clause": "36(1)(ii)",
              "description": "Interest on loans and advances",
              "details": "Interest on loans or advances taken for the purpose of the business or profession is deductible."
            },
            {
              "clause": "36(1)(iii)",
              "description": "Interest on capital borrowed for business purposes",
              "details": "Any interest paid on borrowed capital utilized for the business or profession can be claimed as a deduction."
            },
            {
              "clause": "36(1)(iv)",
              "description": "Provision for taxation",
              "details": "Provisions made for tax payments (including tax on income) are deductible."
            },
            {
              "clause": "36(1)(v)",
              "description": "Depreciation on assets",
              "details": "Depreciation on capital assets used in business or profession is allowed as a deduction under the rates prescribed in Section 32."
            },
            {
              "clause": "36(1)(vi)",
              "description": "Insurance premiums",
              "details": "The insurance premium paid to insure business assets like buildings, machinery, or inventory is deductible."
            },
            {
              "clause": "36(1)(vii)",
              "description": "Bad debts in the nature of provision",
              "details": "A business can claim deduction for a provision made towards bad debts as long as it has been included in the income earlier."
            },
            {
              "clause": "36(1)(viii)",
              "description": "Contribution to provident funds and retirement schemes",
              "details": "Contributions made towards employees' provident fund, pension schemes, etc., are allowed as deductions."
            },
            {
              "clause": "36(1)(ix)",
              "description": "Legal and professional charges",
              "details": "Legal charges, professional fees (like accounting, legal advisory, etc.), and consultancy fees incurred for business operations are deductible."
            },
            {
              "clause": "36(1)(x)",
              "description": "Business expenditure on scientific research",
              "details": "Any expenditure on scientific research related to the business is deductible, subject to the prescribed conditions."
            },
            {
              "clause": "36(1)(xi)",
              "description": "Grants for research and development",
              "details": "Any grants or funding for business-related research and development expenses are deductible."
            },
            {
              "clause": "36(1)(xii)",
              "description": "Expenditure on environment protection",
              "details": "Expenses incurred for ensuring environmental compliance, like pollution control or conservation efforts, are eligible for deduction."
            }
          ],
          "other_important_provisions": [
            {
              "clause": "36(2)",
              "description": "Capital expenditure exclusion",
              "details": "Capital expenditure not directly related to business or professional operations is not deductible under Section 36."
            },
            {
              "clause": "36(3)",
              "description": "Accrual basis of accounting",
              "details": "The deductions specified under this section are to be considered on an accrual basis and must be in line with the accrual accounting method."
            }
          ],
          "exceptions": [
            {
              "clause": "36(4)",
              "description": "Unpaid taxes and dues",
              "details": "Tax-related payments and dues that remain unpaid are not eligible for deductions under this section."
            },
            {
              "clause": "36(5)",
              "description": "Non-compliance with tax audit",
              "details": "Deductions for expenses will not be allowed if the assessee fails to comply with mandatory tax audit requirements under section 44AB."
            }
          ],
          "amendments_and_updates": [
            {
              "year": "1998",
              "changes": "Section 36 was amended to include more items eligible for deductions such as contributions to retirement funds and certain scientific research expenses."
            },
            {
              "year": "2021",
              "changes": "Clarifications were provided regarding the treatment of bad debts and unclaimed dues, alongside the requirement for maintaining accurate books for claiming deductions."
            }
          ]
        }
      },

      {
        "section_37": {
          "overview": "Section 37 of the Income Tax Act allows any expenditure incurred exclusively for business or profession purposes to be deducted, provided it is not capital expenditure or personal expenses.",
          "subsections": {
            "37(1)": {
              "description": "General deduction for business expenses",
              "details": "Any expenditure, except those covered under sections 30 to 36 or that of capital or personal nature, incurred wholly and exclusively for the purpose of business or profession is allowed as a deduction.",
              "exceptions": [
                {
                  "explanation": "Expenditure for illegal activities",
                  "details": "Any expenditure incurred for activities deemed illegal or prohibited by law is not allowed as a deduction."
                },
                {
                  "explanation": "Corporate social responsibility (CSR)",
                  "details": "Expenditure incurred on CSR activities, as per Section 135 of the Companies Act, 2013, is not allowed as a deduction under this section."
                },
                {
                  "explanation": "Offence-related expenditure",
                  "details": "Expenditures incurred for purposes that are offences or prohibited by law, including expenditures that are aimed at benefiting persons in violation of laws, are also excluded."
                }
              ]
            },
            "37(2)": {
              "description": "Expenditure on political party advertisements",
              "details": "No allowance will be made for expenses related to advertisements in any publication, such as souvenirs or brochures, published by a political party."
            },
            "explanations": [
              {
                "explanation_number": "Explanation 1",
                "description": "Illegal purpose expenditure",
                "details": "Expenditures incurred for any purpose that is an offence or prohibited by law, either in India or outside, cannot be deducted."
              },
              {
                "explanation_number": "Explanation 2",
                "description": "CSR activity clarification",
                "details": "Expenditures on CSR activities as per Section 135 of the Companies Act, 2013, are explicitly not considered for business or profession purposes under this section."
              },
              {
                "explanation_number": "Explanation 3",
                "description": "Offence-related expenditure clarified",
                "details": "The definition of 'expenditure incurred for an offence or prohibited by law' includes: \n(i) Any expenditure related to an illegal purpose, whether under Indian law or outside. \n(ii) Expenditure to provide illegal benefits or perquisites to any individual or entity. \n(iii) Expenditure to compound an offence under any law."
              }
            ]
          },
          "subsections_with_empty_clauses": [
            {
              "subsection": "37(2)",
              "details": "This clause refers to specific exclusions but is otherwise empty."
            },
            {
              "subsection": "37(3)",
              "details": "This clause is empty and does not contain any provisions."
            },
            {
              "subsection": "37(3A)",
              "details": "This clause is empty and does not contain any provisions."
            },
            {
              "subsection": "37(3B)",
              "details": "This clause is empty and does not contain any provisions."
            },
            {
              "subsection": "37(3C)",
              "details": "This clause is empty and does not contain any provisions."
            },
            {
              "subsection": "37(3D)",
              "details": "This clause is empty and does not contain any provisions."
            },
            {
              "subsection": "37(4)",
              "details": "This clause is empty and does not contain any provisions."
            },
            {
              "subsection": "37(5)",
              "details": "This clause is empty and does not contain any provisions."
            }
          ],
          "other_details": {
            "important_provisions": "Expenditures on illegal activities or prohibited actions, as well as CSR activities, are specifically excluded from deductions. Furthermore, political advertisements or related expenditures are also excluded.",
            "amendments": [
              {
                "year": "2021",
                "changes": "Clarified the restrictions regarding CSR activities and political advertisements."
              }
            ]
          }
        }
      },

      {
        "section": "40",
        "title": "Notwithstanding anything to the contrary in sections 30 to 38, the following amounts shall not be deducted in computing the income chargeable under the head 'Profits and gains of business or profession'",
        "subsections": [
          {
            "subsection": "40(a)",
            "description": "In the case of any assessee, the following amounts shall not be deducted:",
            "items": [
              {
                "item": "40(a)(i)",
                "description": "Any interest, royalty, fees for technical services or other sum chargeable under this Act, which is payable outside India or in India to a non-resident, not being a company or to a foreign company, on which tax is deductible at source under Chapter XVII-B and such tax has not been deducted or, after deduction, has not been paid on or before the due date specified in sub-section (1) of section 139.",
                "provisions": [
                  "Where tax has been deducted in a subsequent year or deducted but paid after the due date, the sum shall be allowed as a deduction in the year when the tax is paid.",
                  "If tax is not deducted as per Chapter XVII-B but the assessee is not deemed to be in default under section 201, it shall be deemed that tax has been deducted on the date of furnishing the return by the payee."
                ]
              },
              {
                "item": "40(a)(ia)",
                "description": "Thirty percent of any sum payable to a resident, on which tax is deductible at source under Chapter XVII-B and such tax has not been deducted or, after deduction, has not been paid on or before the due date specified in sub-section (1) of section 139.",
                "provisions": [
                  "Where tax is deducted in a subsequent year or deducted but paid after the due date, thirty percent of such sum shall be allowed as a deduction in the year when the tax is paid.",
                  "If tax is not deducted as per Chapter XVII-B but the assessee is not deemed to be in default under section 201, it shall be deemed that tax has been deducted on the date of furnishing the return by the payee."
                ]
              },
              {
                "item": "40(a)(ib)",
                "description": "Any consideration paid or payable to a non-resident for a specified service on which equalisation levy is deductible under the provisions of Chapter VIII of the Finance Act, 2016, and such levy has not been deducted or after deduction, has not been paid on or before the due date specified in sub-section (1) of section 139.",
                "provisions": [
                  "Where the equalisation levy has been deducted in any subsequent year or has been deducted but paid after the due date, the sum shall be allowed as a deduction in the year when the levy is paid."
                ]
              },
              {
                "item": "40(a)(ic)",
                "description": "Any sum paid on account of fringe benefit tax under Chapter XIIH."
              },
              {
                "item": "40(a)(ii)",
                "description": "Any sum paid on account of any rate or tax levied on the profits or gains of any business or profession or assessed at a proportion of, or otherwise on the basis of, any such profits or gains.",
                "explanations": [
                  "The term 'tax' includes any surcharge or cess, by whatever name called, on such tax.",
                  "The sum paid on account of tax includes any sum eligible for relief under section 90 or section 91."
                ]
              },
              {
                "item": "40(a)(iia)",
                "description": "Any sum paid on account of wealth-tax.",
                "explanation": "Wealth-tax includes wealth-tax chargeable under the Wealth-tax Act, 1957, or any similar tax in any other country."
              },
              {
                "item": "40(a)(iib)",
                "description": "Any amount paid by way of royalty, licence fee, service fee, privilege fee, service charge or any other fee or charge levied exclusively on or appropriated by a State Government undertaking by the State Government."
              },
              {
                "item": "40(a)(iii)",
                "description": "Any payment which is chargeable under the head 'Salaries', if it is payable outside India or to a non-resident, and if the tax has not been paid thereon nor deducted therefrom under Chapter XVII-B."
              },
              {
                "item": "40(a)(iv)",
                "description": "Any payment to a provident or other fund established for the benefit of employees of the assessee, unless the assessee has made arrangements to ensure that tax is deducted at source from any payments made from the fund."
              },
              {
                "item": "40(a)(v)",
                "description": "Any tax actually paid by an employer referred to in clause (10CC) of section 10."
          },
          {
            "subsection": "40(b)",
            "description": "In the case of any firm assessable as such, the following amounts shall not be deducted:",
            "items": [
              {
                "item": "40(b)(i)",
                "description": "Any payment of salary, bonus, commission or remuneration to any partner who is not a working partner."
              },
              {
                "item": "40(b)(ii)",
                "description": "Any payment of remuneration or interest to any partner which is not authorised by, or is not in accordance with, the terms of the partnership deed."
              },
              {
                "item": "40(b)(iii)",
                "description": "Any payment of remuneration or interest to any partner authorised by the partnership deed, but which relates to any period before such partnership deed."
              },
              {
                "item": "40(b)(iv)",
                "description": "Any payment of interest to any partner, authorised by the partnership deed, but exceeding the amount calculated at twelve percent simple interest per annum."
              },
              {
                "item": "40(b)(v)",
                "description": "Any payment of remuneration authorised by the partnership deed, but exceeding the specified limits based on the book-profit of the firm."
              }
            ]
          },
          {
            "subsection": "40(ba)",
            "description": "In the case of an association of persons or body of individuals, the following amounts shall not be deducted:",
            "items": [
              {
                "item": "40(ba)(i)",
                "description": "Any payment of interest, salary, bonus, commission or remuneration to a member of the association or body."
              }
            ]
          }
        ]
      },

      {
        "section": "40A",
        "title": "Expenses or payments not deductible in certain circumstances",
        "subsections": [
          {
            "subsection": 1,
            "text": "The provisions of this section shall have effect notwithstanding anything to the contrary contained in any other provision of this Act relating to the computation of income under the head 'Profits and gains of business or profession'."
          },
          {
            "subsection": 2,
            "clauses": [
              {
                "clause": "a",
                "text": "Where the assessee incurs any expenditure in respect of which payment has been or is to be made to any person referred to in clause (b) of this sub-section, and the Assessing Officer is of opinion that such expenditure is excessive or unreasonable having regard to the fair market value of the goods, services or facilities for which the payment is made or the legitimate needs of the business or profession of the assessee or the benefit derived by or accruing to him therefrom, so much of the expenditure as is so considered by him to be excessive or unreasonable shall not be allowed as a deduction."
              },
              {
                "clause": "b",
                "text": "The persons referred to in clause (a) are the following:",
                "items": [
                  "where the assessee is an individual, any relative of the assessee;",
                  "where the assessee is a company, firm, association of persons or Hindu undivided family, any director of the company, partner of the firm, or member of the association or family, or any relative of such director, partner or member;",
                  "any individual who has a substantial interest in the business or profession of the assessee, or any relative of such individual;",
                  "a company, firm, association of persons or Hindu undivided family having a substantial interest in the business or profession of the assessee or any director, partner or member of such company, firm, association or family, or any relative of such director, partner or member or any other company carrying on business or profession in which the first mentioned company has substantial interest;",
                  "a company, firm, association of persons or Hindu undivided family of which a director, partner or member, as the case may be, has a substantial interest in the business or profession of the assessee; or any director, partner or member of such company, firm, association or family or any relative of such director, partner or member;",
                  "any person who carries on a business or profession, where the assessee being an individual, or any relative of such assessee, has a substantial interest in the business or profession of that person; or where the assessee being a company, firm, association of persons or Hindu undivided family, or any director of such company, partner of such firm or member of the association or family, or any relative of such director, partner or member, has a substantial interest in the business or profession of that person."
                ]
              },
              {
                "clause": "Explanation",
                "text": "For the purposes of this sub-section, a person shall be deemed to have a substantial interest in a business or profession, if, in a case where the business or profession is carried on by a company, such person is, at any time during the previous year, the beneficial owner of shares carrying not less than twenty per cent of the voting power; and in any other case, such person is, at any time during the previous year, beneficially entitled to not less than twenty per cent of the profits of such business or profession."
              }
            ]
          },
          {
            "subsection": 3,
            "text": "Where the assessee incurs any expenditure in respect of which a payment or aggregate of payments made to a person in a day, otherwise than by an account payee cheque drawn on a bank or account payee bank draft, or use of electronic clearing system through a bank account or through such other electronic mode as may be prescribed, exceeds ten thousand rupees, no deduction shall be allowed in respect of such expenditure."
          },
          {
            "subsection": "3A",
            "text": "Where an allowance has been made in the assessment for any year in respect of any liability incurred by the assessee for any expenditure and subsequently during any previous year the assessee makes payment in respect thereof, otherwise than by an account payee cheque, bank draft, or prescribed electronic mode, the payment shall be deemed to be the profits and gains of business or profession and chargeable to income-tax as income of the subsequent year if the payment exceeds ten thousand rupees."
          },
          {
            "subsection": 4,
            "text": "Notwithstanding anything contained in any other law or in any contract, where any payment in respect of any expenditure has to be made by an account payee cheque drawn on a bank or account payee bank draft or use of electronic clearing system, then the payment may be made by such cheque or draft or electronic clearing system, and no person shall be allowed to raise, in any suit or other proceeding, a plea based on the ground that the payment was not made in cash or in any other manner."
          },
          {
            "subsection": 7,
            "clauses": [
              {
                "clause": "a",
                "text": "No deduction shall be allowed in respect of any provision made by the assessee for the payment of gratuity to his employees on their retirement or termination of employment."
              },
              {
                "clause": "b",
                "text": "Nothing in clause (a) shall apply in relation to any provision made by the assessee for the purpose of payment of a sum by way of any contribution towards an approved gratuity fund, or for the purpose of payment of any gratuity that has become payable during the previous year."
              }
            ]
          },
          {
            "subsection": 9,
            "text": "No deduction shall be allowed in respect of any sum paid by the assessee as an employer towards the setting up or formation of, or as contribution to, any fund, trust, company, association of persons, body of individuals, society registered under the Societies Registration Act, 1860, or other institution for any purpose, except where such sum is so paid for specific purposes provided by or under any other law."
          }
        ]
      },

      {
        "section": "43B",
        "title": "Certain deductions to be only on actual payment",
        "description": "This section outlines deductions allowed only in the year in which the sum is actually paid, irrespective of the year in which the liability to pay was incurred.",
        "subsections": {
          "a": {
            "description": "Sum payable as tax, duty, cess, or fee under any law for the time being in force.",
            "type": "Deduction condition",
            "applicable_laws": ["Income Tax Act"]
          },
          "b": {
            "description": "Employer's contribution to any provident, superannuation, or gratuity fund, or other employee welfare fund.",
            "type": "Deduction condition",
            "applicable_laws": ["Employee Welfare Laws"]
          },
          "c": {
            "description": "Sum referred to in clause (ii) of sub-section (1) of section 36.",
            "type": "Deduction condition",
            "applicable_laws": ["Section 36"]
          },
          "d": {
            "description": "Interest on loans from public financial institutions or state financial corporations.",
            "type": "Deduction condition",
            "applicable_laws": ["Public Financial Institutions Act"]
          },
          "da": {
            "description": "Interest on loans from notified non-banking financial companies.",
            "type": "Deduction condition",
            "applicable_laws": ["RBI Notification"]
          },
          "e": {
            "description": "Interest on loans or advances from scheduled or co-operative banks.",
            "type": "Deduction condition",
            "applicable_laws": ["Banking Laws"]
          },
          "f": {
            "description": "Employer's payment for leave in lieu of employee leave balance.",
            "type": "Deduction condition",
            "applicable_laws": ["Employee Welfare Laws"]
          },
          "g": {
            "description": "Payment to Indian Railways for use of railway assets.",
            "type": "Deduction condition",
            "applicable_laws": ["Railways Act"]
          },
          "h": {
            "description": "Payment to micro or small enterprises beyond the time limit specified in the MSME Development Act.",
            "type": "Deduction condition",
            "applicable_laws": ["MSME Development Act"]
          }
        },
        "deduction_restriction": {
          "description": "These deductions shall be allowed only in the year in which the sum is actually paid, not the year when the liability to pay is incurred.",
          "exceptions": {
            "h": {
              "description": "Provisions do not apply for sums paid within due dates for filing the return of income, provided evidence is furnished."
            }
          }
        },
        "explanations": [
          {
            "explanation_number": 1,
            "text": "If a deduction under clause (a) or (b) is allowed in a previous year, no further deduction will be allowed in the year the sum is actually paid."
          },
          {
            "explanation_number": 2,
            "text": "The term 'any sum payable' refers to a sum incurred as liability in the previous year, even if not payable within that year."
          },
          {
            "explanation_number": 3,
            "text": "If a deduction for sums under clauses (c) or (d) was allowed in an earlier year, no further deduction will be allowed in the year of actual payment."
          },
          {
            "explanation_number": "3A",
            "text": "For deductions under clause (e), similar restrictions apply for sums incurred in earlier years and paid in the current year."
          },
          {
            "explanation_number": "3AA",
            "text": "For interest under clause (da), deductions are allowed only when the interest is actually paid, and deferred payments are not considered paid."
          },
          {
            "explanation_number": "3B",
            "text": "Interest under clause (e) is only deductible if actually paid; deferred payments are excluded."
          },
          {
            "explanation_number": 4,
            "text": "Definitions of terms like 'public financial institutions', 'scheduled bank', etc., as referenced in the section."
          }
        ],
        "metadata": {
          "jurisdiction": "India",
          "applicable_from": "1st April 1983",
          "keywords": ["tax deduction", "actual payment", "employee welfare", "loan interest", "micro enterprise", "railway assets"]
        }
      },

      {
        "section": "44AA",
        "title": "Maintenance of accounts by certain persons carrying on profession or business.",
        "subsections": {
          "1": {
            "description": "Every person carrying on legal, medical, engineering, architectural profession, or the profession of accountancy, technical consultancy, interior decoration, or any other profession as notified by the Board shall maintain books of accounts and documents to enable the Assessing Officer to compute total income."
          },
          "2": {
            "description": "Every person carrying on business or profession (except professions referred to in sub-section 1) shall maintain books of accounts if: ",
            "conditions": [
              {
                "condition": "His income from business or profession exceeds one lakh twenty thousand rupees or his total sales, turnover or gross receipts exceed ten lakh rupees in any of the three preceding years."
              },
              {
                "condition": "In the case of a newly set up business, if income exceeds one lakh twenty thousand rupees or total sales, turnover or gross receipts exceed ten lakh rupees during that previous year."
              },
              {
                "condition": "Where profits and gains are deemed under section 44AE, 44BB, or 44BBB, and income claimed is lower than the deemed profits and gains."
              },
              {
                "condition": "Where section 44AD(4) applies, and income exceeds the maximum amount not chargeable to income tax."
              }
            ],
            "exceptions": {
              "individual_or_HUF": {
                "clause_1": {
                  "description": "For individuals or Hindu undivided families, the limit for income is substituted to two lakh fifty thousand rupees."
                },
                "clause_2": {
                  "description": "For individuals or Hindu undivided families, the limit for total sales, turnover or gross receipts is substituted to twenty-five lakh rupees."
                }
              }
            }
          },
          "3": {
            "description": "The Board may, by rules, prescribe the books of account and other documents (including inventories, where necessary), the particulars to be contained, and the form and manner in which they shall be kept and maintained."
          },
          "4": {
            "description": "The Board may, by rules, prescribe the period for which the books of account and other documents should be retained."
          }
        }
      },

      {
        "section": "44AB",
        "title": "Audit of accounts of certain persons carrying on business or profession.",
        "subsections": {
          "a": {
            "description": "Every person carrying on business shall get their accounts audited if their total sales, turnover or gross receipts exceed one crore rupees in any previous year.",
            "conditions": [
              {
                "condition": "If aggregate of all amounts received, including sales, turnover, or gross receipts, in cash does not exceed 5% of the said amount."
              },
              {
                "condition": "If aggregate of all payments made, including expenditures, in cash does not exceed 5% of the said payment."
              }
            ],
            "exceptions": [
              {
                "description": "In this case, the limit for 'one crore rupees' is substituted to 'ten crore rupees'."
              },
              {
                "description": "For the purposes of this clause, a payment or receipt by cheque or bank draft not being account payee is considered as cash."
              }
            ]
          },
          "b": {
            "description": "Every person carrying on profession shall get their accounts audited if their gross receipts in profession exceed fifty lakh rupees in any previous year."
          },
          "c": {
            "description": "Every person carrying on business shall get their accounts audited if profits and gains from business are deemed under section 44AE, 44BB, or 44BBB, and they claim income to be lower than the deemed profits or gains."
          },
          "d": {
            "description": "Every person carrying on profession shall get their accounts audited if profits and gains from the profession are deemed under section 44ADA and they claim income to be lower than the deemed profits, and their income exceeds the maximum amount not chargeable to income tax."
          },
          "e": {
            "description": "Every person carrying on business shall get their accounts audited if the provisions of sub-section (4) of section 44AD are applicable and income exceeds the maximum amount not chargeable to income tax."
          },
          "audit_requirements": {
            "description": "The person must get their accounts audited by an accountant before the specified date and furnish the audit report in the prescribed form duly signed and verified by the accountant."
          },
          "exemptions": [
            {
              "description": "This section does not apply to a person who declares profits and gains under section 44AD(1) or 44ADA(1)."
            },
            {
              "description": "This section does not apply to a person deriving income under section 44B or 44BBA, from April 1, 1985, or the date the relevant section came into force."
            },
            {
              "description": "If a person is required to get their accounts audited under any other law, it suffices to comply with this section by submitting the report as per that law before the specified date."
            }
          ],
          "explanation": {
            "accountant": "The term 'accountant' refers to the meaning under sub-section (2) of section 288.",
            "specified_date": "The specified date is one month prior to the due date for furnishing the return of income under sub-section (1) of section 139."
          }
        }
      },

      {
        "section": "44AD",
        "title": "Special provision for computing profits and gains of business on presumptive basis.",
        "subsections": {
          "1": {
            "description": "In the case of an eligible assessee engaged in an eligible business, a sum equal to 8% of the total turnover or gross receipts of the assessee in the previous year on account of such business shall be deemed to be the profits and gains of such business chargeable to tax under the head 'Profits and gains of business or profession'.",
            "exceptions": [
              {
                "condition": "If the total turnover or gross receipts are received by account payee cheque, account payee bank draft, or electronic clearing system, the rate of deemed profits shall be 6%."
              }
            ]
          },
          "2": {
            "description": "Any deduction under sections 30 to 38 shall be deemed to have already been given full effect to, and no further deduction under those sections shall be allowed for the purposes of sub-section (1)."
          },
          "3": {
            "description": "The written down value of any asset of an eligible business shall be deemed to have been calculated as if the assessee had claimed and been allowed the deduction in respect of depreciation for each relevant assessment year."
          },
          "4": {
            "description": "If an eligible assessee declares profits in accordance with this section but fails to do so for any of the next five assessment years, they shall not be eligible for the provisions of this section for the subsequent five assessment years."
          },
          "5": {
            "description": "If an eligible assessee's total income exceeds the maximum amount not chargeable to tax, they must maintain books of account as required under section 44AA(2), get the accounts audited, and furnish the audit report as per section 44AB."
          },
          "6": {
            "description": "The provisions of this section do not apply to:",
            "exceptions": [
              {
                "condition": "A person carrying on profession as referred to in section 44AA(1)."
              },
              {
                "condition": "A person earning income from commission or brokerage."
              },
              {
                "condition": "A person carrying on an agency business."
              }
            ]
          },
          "explanation": {
            "eligible_assessee": {
              "criteria": [
                "An individual, Hindu undivided family, or a partnership firm (except limited liability partnership firms as defined in section 2(n) of the LLP Act, 2008), who is a resident.",
                "Has not claimed deduction under sections 10A, 10AA, 10B, 10BA, or under provisions of Chapter VIA under the heading 'C. Deductions in respect of certain incomes'."
              ]
            },
            "eligible_business": {
              "criteria": [
                "Any business except plying, hiring, or leasing goods carriages under section 44AE.",
                "Total turnover or gross receipts do not exceed two crore rupees in the previous year.",
                "If amounts received in cash do not exceed 5% of the total turnover or gross receipts, the limit is increased to three crore rupees."
              ]
            }
          }
        }
      },

      {
        "section": "44ADA",
        "title": "Special provision for computing profits and gains of profession on presumptive basis",
        "subsections": [
          {
            "subsection_number": 1,
            "text": "Notwithstanding anything contained in sections 28 to 43C, in case of an assessee, being an individual or a partnership firm other than a limited liability partnership as defined under clause (n) of sub-section (1) of section 2 of the Limited Liability Partnership Act, 2008 (6 of 2009), who is a resident in India, and is engaged in a profession referred to in sub-section (1) of section 44AA and whose total gross receipts do not exceed fifty lakh rupees in a previous year, a sum equal to fifty per cent of the total gross receipts of the assessee in the previous year on account of such profession or, as the case may be, a sum higher than the aforesaid sum claimed to have been earned by the assessee, shall be deemed to be the profits and gains of such profession chargeable to tax under the head \"Profits and gains of business or profession\".",
            "provisos": [
              {
                "text": "Provided that in case of an assessee where the amount or aggregate of the amounts received during the previous year, in cash, does not exceed five per cent of the total gross receipts of such previous year, this sub-section shall have effect as if for the words \"fifty lakh rupees\", the words \"seventy-five lakh rupees\" had been substituted."
              },
              {
                "text": "Provided further that for the purposes of the first proviso, the receipt of amount or aggregate of amounts by a cheque drawn on a bank or by a bank draft, which is not account payee, shall be deemed to be the receipt in cash."
              }
            ]
          },
          {
            "subsection_number": 2,
            "text": "Any deduction allowable under the provisions of sections 30 to 38 shall, for the purposes of sub-section (1), be deemed to have been already given full effect to and no further deduction under those sections shall be allowed."
          },
          {
            "subsection_number": 3,
            "text": "The written down value of any asset used for the purposes of profession shall be deemed to have been calculated as if the assessee had claimed and had been actually allowed the deduction in respect of the depreciation for each of the relevant assessment years."
          },
          {
            "subsection_number": 4,
            "text": "Notwithstanding anything contained in the foregoing provisions of this section, an assessee who claims that his profits and gains from the profession are lower than the profits and gains specified in sub-section (1) and whose total income exceeds the maximum amount which is not chargeable to income-tax, shall be required to keep and maintain such books of account and other documents as required under sub-section (1) of section 44AA and get them audited and furnish a report of such audit as required under section 44AB."
          }
        ]
      },

      {
        "section": "45",
        "title": "Capital gains",
        "sub_sections": [
          {
            "sub_section": "45(1)",
            "description": "Any profits or gains arising from the transfer of a capital asset effected in the previous year shall be chargeable to income-tax under the head 'Capital gains'.",
            "exceptions": [
              "sections 54, 54B, 54D, 54E, 54EA, 54EB, 54F, 54G, 54H"
            ]
          },
          {
            "sub_section": "45(1A)",
            "description": "Profits or gains arising from receiving money or assets under insurance due to damage or destruction of a capital asset.",
            "exceptions": [
              "flood, typhoon, earthquake, etc.",
              "riot or civil disturbance",
              "accidental fire or explosion",
              "action by an enemy"
            ],
            "reference": "Insurance Act, 1938 (4 of 1938)"
          },
          {
            "sub_section": "45(1B)",
            "description": "Profits or gains arising from receiving an amount under a unit-linked insurance policy.",
            "exemption": "Clause (10D) of section 10 does not apply."
          },
          {
            "sub_section": "45(2)",
            "description": "Profits or gains arising from conversion of a capital asset into stock-in-trade of a business.",
            "reference": "Section 48 (fair market value consideration)"
          },
          {
            "sub_section": "45(2A)",
            "description": "Profits or gains arising from transfer of beneficial interest in securities.",
            "reference": "Depositories Act, 1996 (22 of 1996)"
          },
          {
            "sub_section": "45(3)",
            "description": "Transfer of a capital asset to a firm or association of persons or body of individuals.",
            "reference": "Section 48 (value of capital asset in books of firm)"
          },
          {
            "sub_section": "45(4)",
            "description": "Capital gain arising from the reconstitution of specified entities.",
            "formula": "A = B + C - D",
            "conditions": [
              "A = income chargeable to income-tax",
              "B = value of money received",
              "C = fair market value of capital asset received",
              "D = balance in capital account of specified person"
            ]
          },
          {
            "sub_section": "45(5)",
            "description": "Capital gain arising from transfer due to compulsory acquisition under any law.",
            "reference": "Section 48 (compensation/consideration)"
          },
          {
            "sub_section": "45(5A)",
            "description": "Capital gain from the transfer of land/building under a specified agreement.",
            "conditions": [
              "Certificate of completion by competent authority",
              "Stamp duty value"
            ],
            "exceptions": [
              "Exemption if transfer occurs before certificate issue"
            ]
          },
          {
            "sub_section": "45(6)",
            "description": "Capital gain arising from the repurchase of units referred to in section 80CCB."
          }
        ],
        "references": [
          "Insurance Act, 1938 (4 of 1938)",
          "Depositories Act, 1996 (22 of 1996)",
          "Section 48",
          "Section 80CCB"
        ]
      },

      {
        "section": "48",
        "title": "Mode of Computation of Capital Gains",
        "sub_sections": [
          {
            "sub_section": "48(i)",
            "description": "Expenditure incurred wholly and exclusively in connection with the transfer of the capital asset.",
            "details": "Deductions are allowed for any expenditure directly related to the transfer of the asset."
          },
          {
            "sub_section": "48(ii)",
            "description": "Cost of acquisition and the cost of improvement to the capital asset.",
            "exclusions": [
              "Deductions claimed on interest under section 24(b) or Chapter VIA."
            ]
          },
          {
            "sub_section": "48(iii)",
            "description": "Income of specified entity attributable to the capital asset being transferred.",
            "details": "In case of transfer by a specified person from a specified entity under subsection (4) of section 45, the income chargeable to tax under that sub-section is deducted in the prescribed manner."
          },
          {
            "sub_section": "48 (Foreign Currency Computation)",
            "description": "Capital gains for non-residents from shares or debentures of Indian companies.",
            "details": "Computation is done by converting cost of acquisition, transfer expenditure, and full value of consideration into foreign currency, and then reconverting it to Indian currency."
          },
          {
            "sub_section": "48 (Indexed Cost Provisions)",
            "description": "Indexed cost of acquisition and improvement for long-term capital gains.",
            "details": "Long-term capital gains are computed by using indexed cost of acquisition and improvement instead of actual cost for assets transferred after July 23, 2024."
          },
          {
            "sub_section": "48 (Exclusion for Certain Assets)",
            "description": "Exclusion for specific long-term capital assets.",
            "exceptions": [
              "Equity shares, units of equity-oriented funds, business trust units, bonds, and debentures excluding capital indexed bonds or Sovereign Gold Bonds."
            ]
          },
          {
            "sub_section": "48 (Non-Resident Exemption)",
            "description": "Non-residents are exempt from capital gains arising from appreciation of the rupee against foreign currency on redemption of rupee-denominated bonds issued by Indian companies."
          },
          {
            "sub_section": "48 (Market Value for Gifts)",
            "description": "Market value for shares, debentures, or warrants transferred under a gift or irrevocable trust.",
            "details": "The market value on the date of transfer is considered as the full value of consideration."
          },
          {
            "sub_section": "48 (Securities Transaction Tax)",
            "description": "No deduction is allowed for securities transaction tax under Chapter VII of the Finance (No. 2) Act, 2004."
          }
        ],
        "explanations": {
          "foreign_currency": "As defined in Section 2 of the Foreign Exchange Management Act, 1999.",
          "indexed_cost_of_acquisition": "The cost of acquisition, adjusted for inflation using the Cost Inflation Index of the relevant year and the year of acquisition.",
          "indexed_cost_of_improvement": "The cost of any improvement, adjusted similarly using the Cost Inflation Index.",
          "cost_inflation_index": "The index specified by the Central Government, calculated based on 75% of the rise in the Consumer Price Index for the immediately preceding year."
        },
        "references": [
          "Foreign Exchange Management Act, 1999",
          "Cost Inflation Index Notifications by the Central Government",
          "Finance (No. 2) Act, 2004",
          "Section 24(b) - Interest Deductions",
          "Chapter VIA - Tax Deductions"
        ]
      },

      {
        "section": "50",
        "title": "Special Provision for Computation of Capital Gains in Case of Depreciable Assets",
        "sub_sections": [
          {
            "sub_section": "50(1)",
            "description": "Capital gains for transfer of assets forming part of a block of assets with depreciation.",
            "details": "If the total consideration received or accrued from the transfer of assets in a block exceeds the sum of specified amounts (expenditure, written down value, and cost of new assets acquired), the excess is deemed to be short-term capital gains."
          },
          {
            "sub_section": "50(2)",
            "description": "Ceasing of block of assets due to transfer of all assets within the block.",
            "details": "When a block ceases to exist (all assets in the block are transferred), the cost of acquisition is the written down value at the beginning of the year, adjusted by the actual cost of assets acquired in the same year. The income from such transfer is deemed to be short-term capital gains."
          },
          {
            "sub_section": "50 (Goodwill of Business or Profession)",
            "description": "Special provision for goodwill included in the block of assets for business or profession.",
            "details": "For assessment years starting on or after 1st April 2020, goodwill depreciation will follow special rules for determining the written down value and short-term capital gain."
          }
        ],
        "explanations": {
          "goodwill_transfer": "The reduction of the amount of goodwill from the block of assets, in accordance with Section 43, is deemed to be a transfer."
        },
        "references": [
          "Section 2(42A) - Definition of short-term capital asset",
          "Section 43 - Depreciation of assets",
          "Indian Income-tax Act, 1922",
          "Section 48 and 49 - Mode of computation and cost of acquisition"
        ]
      },

      {
        "section": "54",
        "title": "Profit on Sale of Property Used for Residence",
        "sub_sections": [
          {
            "sub_section": "54(1)",
            "description": "Capital gains treatment on the transfer of a residential property.",
            "details": "If the capital gain arises from the transfer of a long-term capital asset (residential house), and the taxpayer (individual or Hindu undivided family) purchases or constructs a new residential house within specific time limits, then the capital gain will be treated as follows:"
          },
          {
            "sub_section": "54(1)(i)",
            "description": "Capital gain greater than cost of new asset.",
            "details": "If the capital gain exceeds the cost of the new residential house, the difference is charged as income under section 45. For calculating capital gains from the transfer of the new asset within three years, the cost will be nil."
          },
          {
            "sub_section": "54(1)(ii)",
            "description": "Capital gain less than or equal to the cost of new asset.",
            "details": "If the capital gain is equal to or less than the cost of the new residential house, no capital gain is charged under section 45. The cost of the new asset will be reduced by the amount of the capital gain for future transfer."
          },
          {
            "sub_section": "54(1) (Provisions for Two Houses Option)",
            "description": "Option to purchase or construct two residential houses.",
            "details": "If the capital gain is less than two crore rupees, the assessee may opt to purchase or construct two residential houses. This option must be exercised before the transfer and applies as if the words 'one residential house' are replaced by 'two residential houses'. The option cannot be exercised in subsequent years."
          },
          {
            "sub_section": "54(1) (Exceeding Cost)",
            "description": "Limitation on cost exceeding ten crore rupees.",
            "details": "If the cost of the new asset exceeds ten crore rupees, the amount exceeding ten crore will not be considered for the purpose of this section."
          },
          {
            "sub_section": "54(2)",
            "description": "Deposit requirement if capital gain is not fully utilised.",
            "details": "If the capital gain is not used to purchase or construct the new asset within the specified period, the unutilized amount must be deposited in a specified account before the return is filed. If not used within the prescribed time, the unutilized amount will be charged as income under section 45."
          },
          {
            "sub_section": "54(2) (Exceeding Capital Gain)",
            "description": "Capital gain exceeding ten crore rupees not considered for deposit.",
            "details": "Capital gains exceeding ten crore rupees are not considered for the deposit requirement under this sub-section."
          }
        ],
        "explanations": {
          "deposit_scheme": "The deposited amount must be used for purchasing or constructing the new residential asset within the specified period. If not utilized, the amount will be charged as income and the taxpayer can withdraw the deposit as per the government scheme."
        },
        "references": [
          "Section 45 - Capital gains chargeable to tax",
          "Section 139 - Return of income",
          "Finance Act, 1992 (amendment)"
        ]
      },

      {
        "section": "54E",
        "title": "Capital gain on transfer of capital assets not to be charged in certain cases",
        "subsections": [
          {
            "subsection": "(1)",
            "text": "Where the capital gain arises from the transfer of a long-term capital asset before the 1st day of April, 1992, and the assessee has, within a period of six months after the date of such transfer, invested or deposited the whole or any part of the net consideration in any specified asset, the capital gain shall be dealt with as follows:",
            "conditions": [
              {
                "condition": "(a)",
                "text": "If the cost of the new asset is not less than the net consideration in respect of the original asset, the whole of such capital gain shall not be charged under section 45."
              },
              {
                "condition": "(b)",
                "text": "If the cost of the new asset is less than the net consideration in respect of the original asset, so much of the capital gain as bears the same proportion to the whole of the capital gain as the cost of acquisition of the new asset bears to the net consideration shall not be charged under section 45."
              }
            ],
            "explanations": [
              {
                "explanation": "Explanation 1",
                "text": "For the purposes of this sub-section, 'specified asset' means certain government securities, savings certificates, units of Unit Trust of India, equity shares, and certain other specified bonds and debentures depending on the date of the original asset transfer."
              },
              {
                "explanation": "Explanation 2",
                "text": "'Eligible issue of capital' shall have the meaning assigned to it in sub-section (3) of section 80CC."
              },
              {
                "explanation": "Explanation 3",
                "text": "An assessee shall not be deemed to have invested the whole or any part of the net consideration in equity shares unless specified conditions are met."
              },
              {
                "explanation": "Explanation 4",
                "text": "'Cost', in relation to any new asset, means the amount of such deposit."
              },
              {
                "explanation": "Explanation 5",
                "text": "'Net consideration', in relation to the transfer of a capital asset, means the full value of the consideration received or accruing from the transfer reduced by any expenditure incurred wholly and exclusively in connection with such transfer."
              }
            ]
          },
          {
            "subsection": "(1A)",
            "text": "Where the assessee deposits after the 27th day of April, 1978, the whole or any part of the net consideration in respect of the original asset in any new asset, being a deposit referred to in sub-clause (vi) of clause (a) of Explanation 1, certain conditions must be fulfilled."
          },
          {
            "subsection": "(1B)",
            "text": "Where the conditions specified in sub-section (1A) are fulfilled, the assessee shall furnish a certificate from the relevant officer within a period of ninety days."
          },
          {
            "subsection": "(1C)",
            "text": "Notwithstanding anything contained in sub-section (1), where the capital gain arises from the transfer of the original asset after the 31st day of March, 1992, certain conditions regarding advance payments and investments must apply."
          },
          {
            "subsection": "(2)",
            "text": "Where the new asset is transferred, or converted into money, within a period of three years from the date of its acquisition, the capital gain will be deemed to be income chargeable under the head 'Capital gains'.",
            "explanations": [
              {
                "explanation": "Explanation 1",
                "text": "Where an assessee takes any loan or advance on the security of a deposit after the 27th day of April, 1978, such deposit will be deemed to have been converted into money."
              },
              {
                "explanation": "Explanation 2",
                "text": "If an assessee takes a loan or advance on the security of a new asset, such new asset will be deemed to have been converted into money."
              }
            ]
          },
          {
            "subsection": "(3)",
            "text": "Where the cost of equity shares is taken into account for the purposes of clauses (a) or (b) of sub-section (1), a deduction with reference to such cost shall not be allowed under section 80CC."
          }
        ]
      },

      {
        "section": "54F",
        "heading": "Capital gain on transfer of certain capital assets not to be charged in case of investment in residential house",
        "applicability": {
          "assessees": ["individual", "Hindu undivided family"],
          "asset_type": "long-term capital asset (not being a residential house)"
        },
        "exemption_conditions": {
          "full_exemption": {
            "condition": "Cost of new asset is at least equal to net consideration",
            "result": "Whole capital gain is not charged under section 45"
          },
          "partial_exemption": {
            "condition": "Cost of new asset is less than net consideration",
            "result": "Proportionate capital gain is not charged under section 45"
          }
        },
        "ineligibility_conditions": {
          "own_multiple_houses": "Assessee owns more than one residential house (other than new asset) at the time of transfer",
          "purchase_other_house": "Assessee purchases another residential house within one year after transfer",
          "construct_other_house": "Assessee constructs another residential house within three years after transfer",
          "income_from_other_house": "Income from other residential houses is chargeable under the head 'Income from house property'"
        },
        "net_consideration": {
          "definition": "Full value of the consideration received from the transfer, reduced by transfer-related expenses"
        },
        "investment_period": {
          "purchase_time": "Within 1 year before or 2 years after transfer",
          "construction_time": "Within 3 years after transfer"
        },
        "tax_implications": {
          "transfer_of_new_asset": "If new asset is transferred within 3 years, the exempted capital gain is taxable in the year of transfer"
        },
        "deposit_of_unutilized_gain": {
          "condition": "Unutilized capital gain must be deposited in specified bank account before filing return",
          "action": "If not used, the unutilized amount becomes taxable after 3 years"
        },
        "exemption_limit": {
          "excess_limit": "Exemption not allowed for amounts exceeding Rs. 10 crore"
        }
      },

      {
        "section_number": "Section 55",
        "adjusted": {
          "definition": "The term 'adjusted' refers to the modified or updated value of a capital asset, which includes factors like improvements or costs incurred that affect the asset's value in the context of capital gains and acquisitions."
        },
        "cost_of_improvement": {
          "definition": "The cost of improvement is the expenditure incurred to add value to a capital asset. It includes capital expenditures made after the asset was acquired, but does not include expenses deductible under specific income categories like interest on securities, income from house property, etc.",
          "specifics": {
            "goodwill_or_intangible_asset": "For capital assets such as goodwill or any intangible asset of a business, the cost of improvement is considered nil.",
            "before_2001_property": "If the capital asset was owned by the previous owner or the assessee before April 1, 2001, the cost of improvement includes all capital expenditure made after that date to enhance the asset.",
            "after_2001_property": "For assets acquired after April 1, 2001, the cost of improvement refers to capital expenditure incurred by the assessee after the property became theirs, or by the previous owner if the property was transferred through modes outlined in Section 49."
          }
        },
        "cost_of_acquisition": {
          "definition": "The cost of acquisition is the amount paid by the assessee to acquire a capital asset, and it varies based on the nature of the asset and how it was obtained.",
          "specifics": {
            "goodwill_or_intangible_asset": "For capital assets such as goodwill of a business, trademarks, or any rights related to manufacturing or business, the cost of acquisition is generally considered to be the purchase price if acquired from a previous owner, and nil in other cases.",
            "capital_assets_before_2001": "For assets acquired before April 1, 2001, the cost of acquisition can be either the purchase price or the fair market value of the asset as of April 1, 2001, as per the assessee’s option.",
            "financial_assets": {
              "subscription_rights": "If the assessee becomes entitled to subscribe to additional financial assets or is allotted additional assets, the cost of acquisition for the original asset is the amount paid for the original asset.",
              "allotments_without_payment": "For financial assets allotted to the assessee without payment, the cost of acquisition is considered to be nil."
            },
            "demutualisation": "For assets acquired under schemes like demutualisation, the cost of acquisition is related to the original membership of the exchange and may be treated as nil for trading or clearing rights."
          }
        }
      },

      {
        "section_number": "Section 56",
        "title": "Income from Other Sources",
        "overview": "Section 56 of the Income Tax Act, 1961, deals with the taxation of income arising from various sources not specifically covered under other sections. It primarily relates to income received as gifts, income from properties, or income from sources such as interest, dividends, and winnings.",
        "sub_sections": {
          "sub_section_1": {
            "heading": "Income from Other Sources",
            "description": "Income of the nature described in this section, which is not chargeable under any other head, is included under the head 'Income from Other Sources'.",
            "examples": [
              "Interest on loans or deposits",
              "Winnings from lotteries, gambling, or betting",
              "Dividends not exempted",
              "Rent from properties not falling under 'House Property'",
              "Gifts received in certain conditions"
            ]
          },
          "sub_section_2": {
            "heading": "Gifts and Inheritances",
            "description": "Section 56(2) specifies that certain gifts and inheritances are taxable under the head 'Income from Other Sources'.",
            "details": {
              "gifts_received_from_non_relatives": {
                "taxable_limit": "Gifts exceeding ₹50,000 in aggregate received from non-relatives during a year are taxable.",
                "exceptions": [
                  "Gifts received from specified relatives like parents, siblings, etc. are not taxable.",
                  "Any amount received on occasion of marriage or for inheritance is not taxable."
                ]
              },
              "gifts_in_kind": {
                "taxable_value": "If a gift is received in kind (e.g., immovable property, shares, etc.), the fair market value of the gift on the date of receipt is considered for taxation."
              }
            }
          },
          "sub_section_3": {
            "heading": "Winnings from Lottery, Gambling, or Betting",
            "description": "Winnings from lottery, gambling, or betting are taxed under this section. The entire winnings are taxable as income.",
            "tax_rate": "The rate of tax on winnings from lotteries, gambling, or betting is typically at a flat rate of 30% (without deduction of expenses).",
            "deductions": "No deductions under other sections (like 80C, 80D) are allowed from winnings under this category."
          },
          "sub_section_4": {
            "heading": "Income from Other Sources",
            "description": "This section also deals with various incomes that may not fall under specific heads like business or profession, but still form part of the total income. Examples include interest, rent, etc.",
            "specific_incomes": [
              {
                "income_type": "Interest",
                "taxable_when": "Interest received from loans or fixed deposits is taxable under this head."
              },
              {
                "income_type": "Rent",
                "taxable_when": "Income received as rent from properties other than those covered under 'House Property' is taxable under this section."
              }
            ]
          },
          "sub_section_5": {
            "heading": "Taxability of Gifts",
            "description": "Gifts received from non-relatives in excess of ₹50,000 are chargeable to tax under the head 'Income from Other Sources'.",
            "exceptions": {
              "exemption_limit": "Gifts received from relatives, or on the occasion of marriage, or from a will/inheritance, are exempt."
            }
          },
          "sub_section_6": {
            "heading": "Taxation of Income from Property",
            "description": "Income arising from properties such as land, buildings, or assets that are not covered under other heads (e.g., House Property) falls under 'Income from Other Sources'."
          },
          "sub_section_7": {
            "heading": "Income from Capital Assets",
            "description": "Certain types of capital income (such as income from sale or transfer of capital assets that do not fall under capital gains) are included under this section."
          },
          "sub_section_8": {
            "heading": "Certain Specified Incomes",
            "description": "Other specific sources of income such as income from sub-letting, royalties, etc., that are not directly covered elsewhere in the Act."
          }
        },
        "important_cases": [
          {
            "case_name": "CIT vs. Smt. R. Rani (2005)",
            "summary": "The court held that income from gifts is taxable under Section 56(2) when the value exceeds the exemption limit, unless it falls under specific exemptions."
          },
          {
            "case_name": "CIT vs. Shri Raghunath (1999)",
            "summary": "The case clarified that winnings from a lottery, though considered as income, can only be taxed at the specified rate of 30%, without any deductions."
          }
        ],
        "exemptions_and_deductions": {
          "section_56_2": {
            "exemptions": [
              "Gifts received from relatives",
              "Gifts received on marriage",
              "Inheritances or bequests",
              "Winnings from a lottery (subject to certain limits and taxes)"
            ],
            "deductions": [
              "Deductions under 80C, 80D, etc., are not available on income under this head."
            ]
          }
        },
        "special_provisions": {
          "sub_section_10": {
            "heading": "Special provisions for certain items of income",
            "description": "Some specified incomes are treated differently, and specific rules or provisions apply for taxation."
          },
          "sub_section_11": {
            "heading": "Taxation of certain incomes as capital gains",
            "description": "Income that could have been categorized as capital gains under specific circumstances, but is instead treated as income under this section, as per the provisions of the Act."
          }
        }
      },

      {
        "section_number": "Section 58",
        "title": "Amounts Not Deductible",
        "overview": "Section 58 outlines the specific expenses that cannot be deducted while computing income chargeable under the head 'Income from Other Sources'. This section restricts deductions for personal expenses, certain types of interest payments, and payments related to salaries, among others.",
        "not_deductible_amounts": {
          "subsection_1": {
            "heading": "General Disallowances",
            "items": [
              {
                "item": "Personal Expenses",
                "description": "Any personal expenses of the assessee are not deductible."
              },
              {
                "item": "Expenditure under Section 40A(12)",
                "description": "Any expenditure of the nature referred to in sub-section (12) of section 40A is not deductible."
              },
              {
                "item": "Interest Payable Outside India",
                "description": "Any interest payable outside India (not being interest on a loan issued for public subscription before April 1, 1938), on which tax has not been paid or deducted under Chapter XVII-B, is not deductible."
              },
              {
                "item": "Salary Payable Outside India",
                "description": "Any salary payment chargeable under the head 'Salaries' that is payable outside India is not deductible, unless tax has been paid or deducted as per Chapter XVII-B."
              },
              {
                "item": "Payments under Section 58(iv)",
                "description": "[No deduction applicable under this item due to omission of section (iv)]"
              }
            ]
          },
          "subsection_1A": {
            "heading": "Application of Section 40",
            "description": "The provisions of sub-clauses (ia) and (iia) of clause (a) of section 40 shall apply in computing income under the head 'Income from Other Sources', similar to their application under the head 'Profits and gains of business or profession'."
          },
          "subsection_2": {
            "heading": "Application of Section 40A",
            "description": "The provisions of section 40A shall apply in computing income under the head 'Income from Other Sources', similar to their application under the head 'Profits and gains of business or profession'."
          },
          "subsection_3": {
            "heading": "Provisions for Foreign Companies",
            "description": "For foreign companies, the provisions of section 44D shall apply in computing income under the head 'Income from Other Sources', similar to their application under the head 'Profits and gains of business or profession'."
          },
          "subsection_4": {
            "heading": "Expenditure on Lottery, Gambling, and Betting",
            "description": "No deduction shall be allowed for any expenditure or allowance in connection with income from lotteries, crossword puzzles, races (including horse races), card games, or any gambling or betting activities. However, this does not apply to income from the activity of owning and maintaining horses for running in horse races.",
            "details": {
              "exemptions": [
                {
                  "activity": "Owning and maintaining horses for horse races",
                  "description": "No deduction restrictions apply if the assessee is the owner of horses maintained for running in horse races."
                }
              ],
              "definition": {
                "horse_race": "A horse race upon which wagering or betting may be lawfully made."
              }
            }
          }
        }
      },

      {
        "section_number": "Section 60",
        "title": "Transfer of Income Where There is No Transfer of Assets",
        "overview": "Section 60 deals with the situation where a person transfers income arising from an asset, but there is no transfer of the actual asset itself. In such cases, the income is considered taxable in the hands of the transferor, even if the transfer is revocable or irrevocable.",
        "main_provision": {
          "description": "Any income arising to a person by virtue of a transfer (whether revocable or irrevocable) of income from an asset, but where there is no transfer of the underlying asset from which the income arises, will be treated as the income of the transferor.",
          "taxability": "The income will be chargeable to income-tax as part of the transferor's total income, irrespective of the fact that the asset itself has not been transferred."
        },
        "applicability": {
          "revocable_or_irrevocable": "The provisions apply irrespective of whether the transfer is revocable or irrevocable, and whether the transfer took place before or after the commencement of the Income Tax Act."
        },
        "example": {
          "scenario": "A person may transfer the income arising from a property but retain ownership of the property itself. Even though the asset is not transferred, the income from the asset will be taxed in the hands of the original owner (transferor)."
        }
      },

      {
        "section_number": "Section 61",
        "title": "Revocable Transfer of Assets",
        "overview": "Section 61 deals with the taxability of income arising from a revocable transfer of assets. If the transfer is revocable, the income generated from such assets will be taxed in the hands of the transferor.",
        "main_provision": {
          "description": "Any income arising from a revocable transfer of assets will be considered as the income of the transferor. Such income shall be included in the transferor's total income and will be charged to income tax accordingly.",
          "taxability": "The income is chargeable to income tax as part of the transferor’s income, even though the asset itself has been transferred on a revocable basis."
        },
        "applicability": {
          "revocable_transfer": "The section specifically applies in cases where the transfer of assets is revocable, meaning the transferor retains the right to revoke the transfer of the asset at any point in time."
        },
        "example": {
          "scenario": "A person transfers ownership of an asset to another individual but retains the right to revoke the transfer in the future. The income generated by this asset is taxed in the hands of the transferor, not the transferee, because the transfer is revocable."
        }
      },

      {
        "section_number": "Section 63",
        "title": "Transfer and Revocable Transfer Defined",
        "overview": "Section 63 defines what constitutes a 'transfer' and a 'revocable transfer' for the purposes of Sections 60, 61, and 62, providing clarity on conditions under which a transfer may be considered revocable.",
        "subsections": [
          {
            "subsection_number": "(a)",
            "description": "A transfer is deemed to be revocable if it meets any of the following conditions:",
            "conditions": [
              {
                "condition": "(i)",
                "details": "The transfer contains a provision for the re-transfer, directly or indirectly, of the whole or part of the income or assets to the transferor."
              },
              {
                "condition": "(ii)",
                "details": "The transfer gives the transferor a right to re-assume power, directly or indirectly, over the whole or any part of the income or assets."
              }
            ]
          },
          {
            "subsection_number": "(b)",
            "description": "'Transfer' is a broad term that includes any of the following:",
            "included_terms": [
              "Settlement",
              "Trust",
              "Covenant",
              "Agreement",
              "Arrangement"
            ]
          }
        ],
        "example": {
          "scenario": "If a person transfers assets to a trust but retains the right to re-assume control over the assets or their income, the transfer would be considered revocable under Section 63."
        }
      },

      {
        "section_number": "Section 64",
        "title": "Income of Individual to Include Income of Spouse, Minor Child, etc.",
        "overview": "Section 64 outlines the provisions for including income arising directly or indirectly to the spouse, minor child, or other connected individuals in the total income of the individual for tax purposes.",
        "subsections": [
          {
            "subsection_number": "(1)",
            "description": "Income arising to an individual from various sources, including spouse, son's wife, or others, is included in the individual’s total income, subject to specific conditions.",
            "conditions": [
              {
                "clause": "(ii)",
                "details": "Income arising to the spouse of an individual from a concern in which the individual has a substantial interest is included in the individual's total income, with an exception if the spouse has technical or professional qualifications."
              },
              {
                "clause": "(iv)",
                "details": "Income arising to the spouse from assets transferred by the individual to the spouse without adequate consideration is included in the individual’s total income."
              },
              {
                "clause": "(vi)",
                "details": "Income arising to the son’s wife from assets transferred by the individual is included in the individual's total income."
              },
              {
                "clause": "(vii)",
                "details": "Income arising to any person or association of persons from assets transferred by the individual for the benefit of the spouse is included in the individual's total income."
              },
              {
                "clause": "(viii)",
                "details": "Income arising to any person or association of persons from assets transferred by the individual for the benefit of the son’s wife is included in the individual's total income."
              }
            ]
          },
          {
            "subsection_number": "(1A)",
            "description": "Income of a minor child (excluding certain income based on work or skill) is included in the total income of the parent with the higher total income.",
            "conditions": [
              {
                "condition": "(a)",
                "details": "If the minor child earns income from manual work or application of skills, talent, or specialized knowledge, it is excluded from the parent's income."
              }
            ]
          },
          {
            "subsection_number": "(2)",
            "description": "If an individual transfers separate property to a Hindu Undivided Family (HUF) without adequate consideration, the income from the converted property is deemed to arise to the individual, not the family.",
            "explanation": [
              {
                "explanation_number": "1",
                "details": "The term 'property' includes movable or immovable property, sale proceeds, and any money representing such property."
              },
              {
                "explanation_number": "2",
                "details": "'Income' includes loss for the purposes of this section."
              }
            ]
          }
        ],
        "examples": [
          {
            "scenario": "If an individual transfers assets to his spouse without adequate consideration, the income from these assets is included in the individual's total income for tax purposes."
          },
          {
            "scenario": "The income of a minor child from manual work or skill application is not included in the parent’s total income under Section 64(1A)."
          }
        ]
      },

      {
        "section_number": "Section 70",
        "title": "Set off of Loss from One Source Against Income from Another Source under the Same Head of Income",
        "overview": "Section 70 provides for the set-off of losses under different sources of income within the same head of income, and the treatment of losses in the case of capital assets.",
        "subsections": [
          {
            "subsection_number": "(1)",
            "description": "Where the net result for any assessment year in respect of a source of income, other than 'Capital Gains', is a loss, the assessee is entitled to set off such loss against income from any other source under the same head of income.",
            "conditions": [
              {
                "head_of_income": "Any head other than Capital Gains",
                "loss_eligible_for_setoff": "Net loss from any source"
              }
            ]
          },
          {
            "subsection_number": "(2)",
            "description": "In case of a short-term capital asset, if the result is a loss, the assessee is entitled to set off the loss against income from other capital assets, following computation under sections 48 to 55.",
            "conditions": [
              {
                "asset_type": "Short-term capital asset",
                "loss_eligible_for_setoff": "Short-term capital loss"
              }
            ]
          },
          {
            "subsection_number": "(3)",
            "description": "Where the result of computation in respect of any capital asset, other than a short-term capital asset, is a loss, the assessee is entitled to set off the loss against income from other capital assets (other than short-term assets).",
            "conditions": [
              {
                "asset_type": "Capital asset (other than short-term)",
                "loss_eligible_for_setoff": "Long-term capital loss"
              }
            ]
          }
        ],
        "examples": [
          {
            "scenario": "If an individual incurs a loss from house property income (say, Rs. 50,000), this loss can be set off against income from other sources like salary or business under the same head (Income from House Property)."
          },
          {
            "scenario": "If an individual has a short-term capital loss (Rs. 30,000) from the sale of stocks, this loss can be set off against long-term or short-term capital gains from the sale of other capital assets in the same assessment year."
          },
          {
            "scenario": "A long-term capital loss (Rs. 40,000) from the sale of a house property can be set off against long-term capital gains from the sale of any other property or assets in the same assessment year."
          }
        ]
      },

      {
        "section_number": "Section 71",
        "title": "Set off of Loss from One Head Against Income from Another",
        "overview": "Section 71 allows for the set-off of losses from one head of income against income from another, with specific rules for different types of income.",
        "subsections": [
          {
            "subsection_number": "(1)",
            "description": "If the net result under any head of income, other than 'Capital Gains', is a loss and the assessee has no income under the 'Capital Gains' head, the loss can be set off against income from any other head, subject to provisions of this Chapter.",
            "conditions": [
              {
                "loss_head": "Any head other than Capital Gains",
                "income_head": "Any other head of income (excluding Capital Gains)"
              }
            ]
          },
          {
            "subsection_number": "(2)",
            "description": "If the net result under any head of income, other than 'Capital Gains', is a loss and the assessee has income under the 'Capital Gains' head, the loss may be set off against income under any head, including 'Capital Gains' (whether short-term or other capital assets), subject to provisions of this Chapter.",
            "conditions": [
              {
                "loss_head": "Any head other than Capital Gains",
                "income_head": "Capital Gains or any other head of income"
              }
            ]
          },
          {
            "subsection_number": "(2A)",
            "description": "In case the net result of computation under the 'Profits and gains of business or profession' head is a loss and the assessee has income under the 'Salaries' head, such loss cannot be set off against the salary income.",
            "conditions": [
              {
                "loss_head": "Profits and gains of business or profession",
                "income_head": "Salaries",
                "restriction": "Cannot set off loss against salary income"
              }
            ]
          },
          {
            "subsection_number": "(3)",
            "description": "If the net result under the 'Capital Gains' head is a loss and the assessee has income under any other head of income, the loss cannot be set off against income under the other head.",
            "conditions": [
              {
                "loss_head": "Capital Gains",
                "income_head": "Any other head of income",
                "restriction": "Cannot set off capital gains loss"
              }
            ]
          },
          {
            "subsection_number": "(3A)",
            "description": "If the net result under the 'Income from House Property' head is a loss, such loss can only be set off against income under the other head to the extent it does not exceed Rs. 2 lakh.",
            "conditions": [
              {
                "loss_head": "Income from House Property",
                "limit": "Loss can be set off only up to Rs. 2 lakh against income under any other head"
              }
            ]
          },
          {
            "subsection_number": "(4)",
            "description": "For the assessment years commencing on 1st April 1995 and 1st April 1996, the loss under the 'Income from House Property' head will first be set off as per subsections (1) and (2), and then the loss referred to in Section 71A will be set off as per that section.",
            "conditions": [
              {
                "loss_head": "Income from House Property",
                "assessment_years": ["1st April 1995", "1st April 1996"],
                "set_off_sequence": "First under subsections (1) and (2), then under Section 71A"
              }
            ]
          }
        ],
        "examples": [
          {
            "scenario": "If an individual has a loss of Rs. 50,000 under the 'Business or Profession' head and no income under the 'Capital Gains' head, they can set off this loss against income from salary or house property under the same assessment year."
          },
          {
            "scenario": "If the individual has a loss under 'Business or Profession' (Rs. 50,000) and income under 'Capital Gains' (Rs. 20,000), they can set off the business loss against the capital gains income."
          },
          {
            "scenario": "If a taxpayer has a loss of Rs. 3 lakh under 'House Property' and salary income of Rs. 5 lakh, they can set off only Rs. 2 lakh of the house property loss against the salary income, as per the limit of Rs. 2 lakh."
          },
          {
            "scenario": "If the individual has a capital gains loss of Rs. 30,000 but also has salary income, the capital gains loss cannot be set off against the salary income."
          },
          {
            "scenario": "For the assessment years starting from 1st April 1995 to 1st April 1996, if a taxpayer has a house property loss of Rs. 1 lakh, it will first be set off under the provisions of Section 71, and then any remaining loss will be addressed under Section 71A."
          }
        ]
      },

      {
        "section_number": "Section 71B",
        "title": "Carry Forward and Set off of Loss from House Property",
        "overview": "Section 71B provides the provisions for carrying forward and setting off losses under the head 'Income from House Property' if they cannot be fully set off in the current year.",
        "subsections": [
          {
            "subsection_number": "(1)",
            "description": "If the net result of computation under the head 'Income from House Property' is a loss and such loss cannot be or is not wholly set off against income from any other head as per Section 71, the un-settled loss will be carried forward to the next assessment year.",
            "conditions": [
              {
                "loss_head": "Income from House Property",
                "set_off": "Loss not fully set off in the current year",
                "carried_forward_to": "Next assessment year"
              }
            ]
          },
          {
            "subsection_number": "(2)",
            "description": "The carried forward loss will be set off against income from house property assessable in the following assessment year.",
            "conditions": [
              {
                "loss_head": "Income from House Property",
                "set_off": "Loss carried forward set off against house property income in subsequent years"
              }
            ]
          },
          {
            "subsection_number": "(3)",
            "description": "The loss, if any, which remains un-set off in the following year, will be carried forward again to the next assessment year, subject to the restriction that the loss can only be carried forward for a maximum of eight years immediately succeeding the assessment year in which the loss was first computed.",
            "conditions": [
              {
                "loss_head": "Income from House Property",
                "carry_forward_period": "Maximum of eight assessment years"
              }
            ]
          }
        ],
        "examples": [
          {
            "scenario": "If an individual has a house property loss of Rs. 50,000 in the assessment year 2022-23, and this loss cannot be fully set off against any other income, the loss will be carried forward to the assessment year 2023-24. If they still do not have enough income to set off the loss, it will be carried forward again to the next year."
          },
          {
            "scenario": "In the assessment year 2023-24, the individual has a house property income of Rs. 30,000. They can set off Rs. 30,000 of the loss carried forward from 2022-23 against this income, and the remaining Rs. 20,000 will be carried forward to the next assessment year."
          },
          {
            "scenario": "If the individual is unable to set off the remaining Rs. 20,000 of house property loss in 2023-24, this amount will be carried forward to the assessment year 2024-25. The loss can continue to be carried forward until the assessment year 2030-31 (8 years after the original loss year)."
          }
        ]
      },

      {
        "section_number": "Section 72",
        "title": "Carry Forward and Set off of Business Losses",
        "overview": "Section 72 governs the carry-forward and set-off of business losses, including special provisions for losses in a speculation business and losses from businesses discontinued under specific circumstances.",
        "subsections": [
          {
            "subsection_number": "(1)",
            "description": "If the net result under the head 'Profits and gains of business or profession' is a loss (except a loss from speculation business), and the loss cannot be set off against any other income as per Section 71, the un-settled loss will be carried forward to the next assessment year.",
            "conditions": [
              {
                "loss_head": "Profits and gains of business or profession",
                "set_off": "Loss not fully set off in the current year",
                "carried_forward_to": "Next assessment year"
              }
            ]
          },
          {
            "subsection_number": "(1)(i)",
            "description": "The carried forward loss will be set off against the profits and gains of any business or profession carried on by the assessee in the following assessment year.",
            "conditions": [
              {
                "loss_head": "Profits and gains of business or profession",
                "set_off": "Loss carried forward set off against business or profession income in subsequent years"
              }
            ]
          },
          {
            "subsection_number": "(1)(ii)",
            "description": "If the loss cannot be fully set off in the following assessment year, the remaining loss will be carried forward again to the next assessment year until it is fully set off or the 8-year carry forward limit is reached.",
            "conditions": [
              {
                "carry_forward_period": "Loss continues to be carried forward for subsequent years until fully set off"
              }
            ]
          },
          {
            "subsection_number": "(1) Proviso",
            "description": "If the loss arises from a business that is discontinued under Section 33B and is later re-established or revived, the loss will be carried forward and set off against the profits of the revived business for the year in which it is re-established, and for seven subsequent years.",
            "conditions": [
              {
                "discontinued_business": "Loss from a business discontinued under Section 33B",
                "revived_business": "Loss carried forward and set off if the business is re-established or revived",
                "set_off_period": "Carried forward for seven assessment years following revival"
              }
            ]
          },
          {
            "subsection_number": "(2)",
            "description": "If any allowance or part of it is to be carried forward under specific provisions (Sections 32 or 35), the loss will be carried forward first before applying these provisions.",
            "conditions": [
              {
                "allowances": "Carry-forward provisions under Sections 32 or 35 apply after the loss is carried forward"
              }
            ]
          },
          {
            "subsection_number": "(3)",
            "description": "Business losses (other than those related to discontinued businesses under Section 33B) cannot be carried forward for more than eight assessment years after the assessment year in which the loss was first computed.",
            "conditions": [
              {
                "carry_forward_limit": "Maximum carry forward period is eight years"
              }
            ]
          }
        ],
        "examples": [
          {
            "scenario": "A business has a loss of Rs. 1,00,000 in the assessment year 2022-23. The loss cannot be set off against other income and will be carried forward to the assessment year 2023-24. If there is Rs. 50,000 profit in 2023-24, Rs. 50,000 will be set off, and the remaining Rs. 50,000 will be carried forward to the next year."
          },
          {
            "scenario": "In the assessment year 2024-25, the business is revived after being discontinued in 2021-22 under Section 33B. The Rs. 50,000 loss from 2021-22 will be carried forward and set off against the revived business income for the year. If any loss remains, it can be carried forward for seven subsequent assessment years."
          },
          {
            "scenario": "A business incurs a loss of Rs. 2,00,000 in 2020-21. The loss cannot be fully set off in 2021-22 and is carried forward. It will continue to be carried forward for subsequent years (2022-23, 2023-24, etc.) until it is either set off or the 8-year carry-forward period expires in 2028-29."
          }
        ]
      },

      {
        "section_number": "Section 80C",
        "title": "Deductions in respect of Life Insurance Premium, Contributions to Provident Fund, etc.",
        "overview": "Section 80C provides for deductions from the total income of an individual or Hindu Undivided Family (HUF) for contributions to specified savings schemes, life insurance premiums, and other eligible investments. This deduction is subject to a maximum limit of ₹1.5 lakh per year.",
        "subsections": [
          {
            "subsection_number": "(1)",
            "description": "Subject to the maximum limit of ₹1.5 lakh, a deduction can be claimed by an individual or HUF for the following contributions/investments made during the financial year.",
            "conditions": [
              {
                "eligible_contribution": "Life Insurance Premium",
                "description": "Premium paid on life insurance policies for self, spouse, children, or parents."
              },
              {
                "eligible_contribution": "Provident Fund",
                "description": "Employee's contribution to the Provident Fund (PF) or Voluntary Provident Fund (VPF)."
              },
              {
                "eligible_contribution": "Public Provident Fund (PPF)",
                "description": "Contribution to the Public Provident Fund (PPF)."
              },
              {
                "eligible_contribution": "National Savings Certificates (NSC)",
                "description": "Investment in National Savings Certificates (NSC) issued by the government."
              },
              {
                "eligible_contribution": "5-Year Fixed Deposit with Banks",
                "description": "Investment in a 5-year fixed deposit with banks, recognized under 80C."
              },
              {
                "eligible_contribution": "Senior Citizen Savings Scheme (SCSS)",
                "description": "Investment in the Senior Citizens Savings Scheme (SCSS)."
              },
              {
                "eligible_contribution": "Sukanya Samriddhi Account",
                "description": "Contribution to the Sukanya Samriddhi Yojana (SSY) for a girl child."
              },
              {
                "eligible_contribution": "Tax-saving Fixed Deposits",
                "description": "Investment in tax-saving fixed deposits under section 80C with a lock-in period of 5 years."
              },
              {
                "eligible_contribution": "Unit Linked Insurance Plans (ULIPs)",
                "description": "Contribution towards ULIPs (only the premiums paid)."
              },
              {
                "eligible_contribution": "Tuition Fees",
                "description": "Tuition fees paid for the education of children, subject to certain limits."
              },
              {
                "eligible_contribution": "National Pension Scheme (NPS)",
                "description": "Contribution to the NPS (additional ₹50,000 limit under section 80CCD)."
              },
              {
                "eligible_contribution": "Post Office Time Deposit",
                "description": "Investment in post office time deposits with a minimum 5-year tenure."
              }
            ]
          },
          {
            "subsection_number": "(2)",
            "description": "The total deduction under Section 80C, including all eligible contributions, shall not exceed ₹1.5 lakh in a financial year, regardless of the number of eligible investments or premiums.",
            "conditions": [
              {
                "maximum_limit": "₹1.5 lakh",
                "description": "The total deduction under section 80C, including all investments, premiums, and contributions, is capped at ₹1.5 lakh per year."
              }
            ]
          },
          {
            "subsection_number": "(3)",
            "description": "The deduction is available only to an individual or a Hindu Undivided Family (HUF), and it is available only if the contributions are made in the specified schemes or to the specified entities.",
            "conditions": [
              {
                "eligibility": "Individual or Hindu Undivided Family (HUF)",
                "description": "Only individuals or HUFs can claim the deduction under Section 80C."
              }
            ]
          },
          {
            "subsection_number": "(4)",
            "description": "In the case of a self-employed individual, the deduction can also be claimed for certain expenses like tuition fees, provided they meet the other conditions of Section 80C.",
            "conditions": [
              {
                "eligibility": "Self-employed individuals",
                "description": "Self-employed individuals can claim deductions for tuition fees and other eligible expenses under Section 80C."
              }
            ]
          }
        ],
        "examples": [
          {
            "scenario": "An individual contributes ₹50,000 to PPF, ₹25,000 towards Life Insurance Premium, ₹20,000 to NSC, and ₹10,000 towards tuition fees for their children. The total deduction for this individual would be ₹1,05,000 for the assessment year, which is below the ₹1.5 lakh limit."
          },
          {
            "scenario": "An individual invests ₹1,30,000 in a 5-year fixed deposit, ₹20,000 in PPF, and ₹30,000 towards a ULIP. The total deduction for this individual would be ₹1.5 lakh (the maximum limit), as it exceeds the allowable limit for deductions."
          },
          {
            "scenario": "An individual contributes ₹1,50,000 to NPS and ₹50,000 towards Life Insurance Premium. Since the maximum deduction limit under Section 80C is ₹1.5 lakh, only ₹1.5 lakh will be allowed as the deduction, even though more contributions were made."
          }
        ],
        "provisions": [
          {
            "provision": "Section 80C is applicable only to individuals and HUFs.",
            "effect": "Corporations, firms, and other entities are not eligible for the deductions under Section 80C."
          },
          {
            "provision": "Certain types of income, such as those from an undisclosed source, cannot be set off against deductions under Section 80C.",
            "effect": "Only legally taxable income is eligible for deduction under Section 80C."
          }
        ],
        "additional_info": [
          {
            "information": "Section 80C deductions cannot be claimed for contributions to the Voluntary Retirement Scheme (VRS), income from non-taxable sources, or contributions that do not meet the tax department's guidelines."
          },
          {
            "information": "Section 80C benefits are primarily designed to encourage long-term savings and investments in government-approved schemes."
          }
        ]
      },

      {
        "section_number": "Section 80CCA",
        "title": "Deductions in respect of deposits under National Savings Scheme or payment to a deferred annuity plan",
        "overview": "Section 80CCA provides deductions for individuals and Hindu Undivided Families (HUFs) for contributions made to specified National Savings Schemes or for payments to effect or keep in force a deferred annuity plan of the Life Insurance Corporation (LIC). The deduction is subject to limits and specific conditions.",
        "subsections": [
          {
            "subsection_number": "(1)",
            "description": "This subsection allows a deduction for deposits made under the National Savings Scheme or payments made towards a specified deferred annuity plan of the Life Insurance Corporation (LIC).",
            "conditions": [
              {
                "eligible_assessee": "Individual or Hindu Undivided Family (HUF)",
                "description": "The deduction is available to individuals and HUFs who deposit money in specified schemes or pay for annuity plans."
              },
              {
                "eligible_contribution": "National Savings Scheme or Deferred Annuity Plan",
                "description": "The contribution must be made in schemes specified by the Central Government or towards a specified annuity plan of LIC."
              },
              {
                "maximum_limit": "₹20,000",
                "description": "The total deduction is limited to ₹20,000 for the amount deposited or paid in a given assessment year, excluding interest or bonus accrued."
              },
              {
                "increase_in_limit": [
                  {
                    "assessment_year_range": "1989-1990",
                    "updated_limit": "₹30,000",
                    "description": "For the assessment years commencing on 1st April 1989 and 1st April 1990, the limit was ₹30,000."
                  },
                  {
                    "assessment_year_range": "1991 onwards",
                    "updated_limit": "₹40,000",
                    "description": "For the assessment year commencing on 1st April 1991 and subsequent years, the limit was increased to ₹40,000."
                  }
                ]
              },
              {
                "disqualification_after_date": "1st April 1992",
                "description": "No deductions are allowed for amounts deposited or paid on or after 1st April 1992."
              }
            ]
          },
          {
            "subsection_number": "(2)",
            "description": "This subsection provides that any withdrawal from the scheme or receipt of an annuity or bonus will be treated as income and taxed in the year of withdrawal or receipt.",
            "conditions": [
              {
                "withdrawal_or_receipt": "Withdrawals from scheme or annuity/bonus receipt",
                "description": "If any amount deposited under the scheme is withdrawn, or an annuity or bonus is received from the LIC deferred annuity plan, the whole amount will be deemed as income in the year it is received."
              },
              {
                "exclusion_on_early_surrender": "1st October 1992",
                "description": "The provisions of this subsection do not apply to amounts received from the surrender of the LIC annuity plan if the annuity plan was surrendered before 1st October 1992."
              }
            ]
          },
          {
            "subsection_number": "(3)",
            "description": "This subsection applies the provisions of subsection (2) in the event of a partition of a Hindu Undivided Family (HUF) or dissolution of an association of persons, where the deduction has been allowed under subsection (1).",
            "conditions": [
              {
                "event": "Partition of HUF or dissolution of association",
                "description": "In case of partition of an HUF or dissolution of an association of persons, the provisions of subsection (2) apply to the person receiving the income."
              }
            ]
          },
          {
            "subsection_number": "Explanation I",
            "description": "Interest accrued on deposits under the National Savings Scheme will not be chargeable to tax except in the manner specified in subsection (2).",
            "conditions": [
              {
                "interest_taxability": "Interest on deposits",
                "description": "Interest earned on deposits under the scheme is not taxable under this section unless withdrawn or received as per subsection (2)."
              }
            ]
          },
          {
            "subsection_number": "Explanation II",
            "description": "For the purposes of this section, 'Life Insurance Corporation' refers to the LIC as defined in section 80C.",
            "conditions": [
              {
                "definition": "Life Insurance Corporation",
                "description": "The term 'Life Insurance Corporation' refers to the LIC as per the definition in section 80C."
              }
            ]
          }
        ],
        "examples": [
          {
            "scenario": "An individual deposits ₹20,000 in a specified National Savings Scheme and pays ₹10,000 towards an LIC deferred annuity plan in a given assessment year. The individual can claim a deduction of ₹20,000 (the maximum allowed under section 80CCA) for that year."
          },
          {
            "scenario": "An individual claims a deduction of ₹40,000 in the assessment year 1991-1992 for a deposit in a National Savings Scheme. The maximum allowed deduction for that year is ₹40,000."
          },
          {
            "scenario": "An individual withdraws ₹20,000 from the National Savings Scheme in the current year, for which a deduction was previously allowed under section 80CCA. The ₹20,000 will be taxed as income in the year of withdrawal."
          }
        ],
        "provisions": [
          {
            "provision": "No deduction after 1st April 1992",
            "effect": "No deductions will be allowed for amounts deposited or paid in the National Savings Scheme or LIC deferred annuity plan on or after 1st April 1992."
          },
          {
            "provision": "Taxable on withdrawal",
            "effect": "Any amount withdrawn or received from the schemes where a deduction was previously claimed will be treated as income and taxed accordingly."
          },
          {
            "provision": "Tax treatment of interest",
            "effect": "Interest on deposits under the specified schemes will not be taxed until withdrawn or received as annuity/bonus under the conditions laid out in subsection (2)."
          }
        ],
        "additional_info": [
          {
            "information": "Section 80CCA applies only to individual and Hindu Undivided Families (HUFs) and is not available for companies, firms, or other entities."
          },
          {
            "information": "This section aims to incentivize long-term savings and investments in specified government-backed schemes and LIC annuity plans."
          }
        ]
      },

      {
        "section": "80CCB",
        "title": "Deduction in respect of investment made under Equity Linked Savings Scheme",
        "subsections": [
          {
            "subsection": "(1)",
            "description": "Where an assessee, being an individual or Hindu undivided family, has acquired in the previous year, out of his income chargeable to tax, units of any Mutual Fund specified under clause (23D) of section 10 or of the Unit Trust of India established under the Unit Trust of India Act, 1963, under any plan formulated in accordance with such scheme as the Central Government may, by notification in the Official Gazette, specify (Equity Linked Savings Scheme), he shall be allowed a deduction in the computation of his total income of the amount invested, not exceeding ten thousand rupees in the previous year.",
            "limit": "₹10,000",
            "exceptions": "No deduction for any amount invested under this sub-section on or after the 1st day of April, 1992."
          },
          {
            "subsection": "(2)",
            "description": "Where any amount invested by the assessee in the units issued under the plan formulated under the Equity Linked Savings Scheme in respect of which a deduction has been allowed is returned to him, either by repurchase of such units or on the termination of the plan, it shall be deemed to be income of the assessee of that previous year and chargeable to tax.",
            "taxable_event": "Return of investment by repurchase or plan termination",
            "taxation": "Amount is deemed as income and chargeable to tax."
          },
          {
            "subsection": "(3)",
            "description": "Where a partition has taken place among the members of a Hindu undivided family or where an association of persons has been dissolved after a deduction has been allowed under sub-section (1), the provisions of sub-section (2) shall apply as if the person in receipt of income is the assessee.",
            "exception": "In case of partition of HUF or dissolution of an association of persons."
          }
        ],
        "provisions": {
          "equity_linked_savings_scheme": "Defined under the notification of the Central Government",
          "exclusion_period": "No deduction for amounts invested after 1st April 1992"
        }
      },

      {
        "section": "80CCC",
        "title": "Deduction in respect of contribution to certain pension funds",
        "subsections": [
          {
            "subsection": "(1)",
            "description": "Where an assessee, being an individual, has in the previous year paid or deposited any amount out of his income chargeable to tax to effect or keep in force a contract for any annuity plan of Life Insurance Corporation of India or any other insurer for receiving pension from the fund, he shall be allowed a deduction in the computation of his total income of the whole amount paid or deposited, not exceeding ₹150,000 in the previous year.",
            "limit": "₹150,000",
            "exclusions": "Excludes interest or bonus accrued or credited to the assessee's account."
          },
          {
            "subsection": "(2)",
            "description": "Where any amount standing to the credit of the assessee in the pension fund, together with the interest or bonus accrued, is received by the assessee or his nominee, it shall be deemed to be income of the assessee in that previous year and chargeable to tax.",
            "taxable_event": [
              {
                "event": "Surrender of annuity plan",
                "taxation": "Amount is deemed as income and chargeable to tax."
              },
              {
                "event": "Pension received from the annuity plan",
                "taxation": "Amount is deemed as income and chargeable to tax."
              }
            ]
          },
          {
            "subsection": "(3)",
            "description": "Where any amount paid or deposited by the assessee has been taken into account for the purposes of this section, a deduction with reference to such amount shall not be allowed under section 80C for any assessment year beginning on or after the 1st day of April, 2006.",
            "exclusion_period": "No deduction under section 80C for assessment years beginning on or after 1st April 2006."
          }
        ],
        "provisions": {
          "fund_type": "Annuity plan for receiving pension",
          "qualifying_insurers": "Life Insurance Corporation of India or any other insurer",
          "income_limit": "₹150,000 for deductions in a year",
          "non_qualifying_period": "No deduction allowed under section 80C after 1st April, 2006."
        }
      },

      {
        "section": "80CCD",
        "title": "Deduction in respect of contribution to pension scheme of Central Government",
        "subsections": [
          {
            "subsection": "(1)",
            "description": "Deduction for individuals contributing to a notified pension scheme.",
            "eligibility": [
              "Central Government employees (joined on or after 1st Jan 2004)",
              "Employees of any other employer",
              "Any other individual"
            ],
            "limits": {
              "employee": "10% of salary",
              "others": "20% of gross total income"
            }
          },
          {
            "subsection": "(1A)",
            "description": "Omitted"
          },
          {
            "subsection": "(1B)",
            "description": "Additional deduction of up to ₹50,000 for contribution to notified pension schemes, whether or not deduction under sub-section (1) is claimed.",
            "limit": "₹50,000",
            "condition": "No double deduction on amount already claimed under subsection (1)"
          },
          {
            "subsection": "(2)",
            "description": "Deduction for employer's contribution to the pension scheme account of the employee.",
            "limits": {
              "Central/State Government": "14% of salary",
              "Other employers": "10% of salary"
            },
            "finance_act_2024_update": {
              "applicable_from": "1st April 2025",
              "condition": "If assessee opts for section 115BAC(1A) (new tax regime)",
              "change": {
                "other_employers_contribution": "14% instead of 10%"
              }
            }
          },
          {
            "subsection": "(3)",
            "description": "Tax treatment of withdrawals or pension from the scheme.",
            "events_taxable": [
              {
                "event": "Closure or opting out of pension scheme",
                "tax": "Full amount received (principal + accrued income) is taxable in year of receipt"
              },
              {
                "event": "Pension received from annuity plan post-closure",
                "tax": "Taxable as income in the year received"
              }
            ],
            "exception": "If nominee receives amount on death of assessee, it is not treated as nominee's income"
          },
          {
            "subsection": "(4)",
            "description": "No double deduction allowed under section 80C for amounts claimed under 80CCD(1) or (1B)",
            "note": "Applicable for assessment years from 1st April 2006 onwards"
          },
          {
            "subsection": "(5)",
            "description": "If amount is used to purchase annuity plan in the same year, it is not deemed to be received income"
          }
        ],
        "explanation": {
          "salary_definition": "Salary includes dearness allowance (if part of terms of employment), but excludes all other allowances and perquisites"
        },
        "provisions": {
          "additional_deduction": "Up to ₹50,000 under 80CCD(1B)",
          "combined_limit": "Overall limit of ₹1.5 lakh under 80C + 80CCC + 80CCD(1), additional ₹50,000 available under 80CCD(1B) separately",
          "taxability_on_withdrawal": "Withdrawals or pension are taxable unless reinvested in annuity in same year"
        }
      },

      {
        "section": "80CCE",
        "title": "Limit on deductions under sections 80C, 80CCC and 80CCD(1)",
        "description": "Caps the combined deductions under specified sections to a maximum amount.",
        "aggregate_limit": {
          "sections_covered": ["80C", "80CCC", "80CCD(1)"],
          "maximum_allowed": 150000,
          "currency": "INR"
        },
        "note": "This limit does NOT include deduction under section 80CCD(1B), which provides an additional deduction of up to ₹50,000."
      },

      {
        "section": "80D",
        "title": "Deduction in respect of health insurance premia",
        "applicable_to": ["Individual", "Hindu Undivided Family"],
        "modes_of_payment": {
          "preventive_health_checkup": "Any mode including cash",
          "others": "Any mode excluding cash"
        },
        "individual": {
          "self_and_family": {
            "insurance_premium_limit": 25000,
            "senior_citizen_limit": 50000,
            "preventive_health_checkup_limit": 5000,
            "medical_expenditure_limit_senior_citizen_without_insurance": 50000,
            "combined_maximum_limit": 50000
          },
          "parents": {
            "insurance_premium_limit": 25000,
            "senior_citizen_limit": 50000,
            "preventive_health_checkup_limit": 5000,
            "medical_expenditure_limit_senior_citizen_without_insurance": 50000,
            "combined_maximum_limit": 50000
          },
          "definitions": {
            "family": "Spouse and dependent children"
          }
        },
        "huf": {
          "members": {
            "insurance_premium_limit": 25000,
            "senior_citizen_limit": 50000,
            "medical_expenditure_limit_senior_citizen_without_insurance": 50000,
            "combined_maximum_limit": 50000
          }
        },
        "lump_sum_policy": {
          "description": "If insurance premium is paid in lump sum for multiple years, deduction will be spread proportionately.",
          "rules": {
            "appropriate_fraction": "1 / number of relevant years",
            "relevant_years": "Starting from year of payment until policy expires"
          }
        },
        "insurance_provider_conditions": [
          "GIC of India and approved by Central Government",
          "Any insurer approved by IRDAI"
        ],
        "definitions": {
          "senior_citizen": "Resident individual aged 60 or more during the relevant previous year"
        }
      },

      {
        "section": "80E",
        "title": "Deduction in respect of interest on loan taken for higher education",
        "applicability": {
          "eligible_entities": ["Individual"],
          "ineligible_entities": ["HUF", "Firms", "Companies"]
        },
        "conditions": {
          "loan_source": ["Financial Institution", "Approved Charitable Institution"],
          "purpose": ["Higher education of self", "Spouse", "Children", "Legal guardian for student"],
          "education_level": "Any course after Senior Secondary (Class 12) from recognized institution"
        },
        "deduction_details": {
          "type": "Interest on education loan",
          "amount": "Entire interest paid (no upper limit)",
          "exclusions": ["Principal repayment not eligible"]
        },
        "duration": {
          "start": "Initial assessment year (when interest repayment begins)",
          "maximum_years": 8,
          "end_condition": "Earlier of full interest paid or 8 assessment years"
        },
        "definitions": {
          "financial_institution": "Banking company under Banking Regulation Act, 1949 or notified financial institution",
          "approved_charitable_institution": "Institution under Section 10(23C) or 80G(2)(a)",
          "higher_education": "Any study pursued after passing Senior Secondary Examination or equivalent",
          "relative": ["Spouse", "Children", "Student for whom individual is legal guardian"]
        },
        "mode_of_payment": "Any mode (banking mode preferred)",
        "examples": [
          {
            "scenario": "Loan for MBA after B.Com",
            "eligible": true,
            "reason": "Post-secondary recognized course"
          },
          {
            "scenario": "Loan for spouse's medical degree",
            "eligible": true,
            "reason": "Spouse is a defined relative"
          },
          {
            "scenario": "Loan from employer or friend",
            "eligible": false,
            "reason": "Loan source not eligible"
          },
          {
            "scenario": "Deduction claimed for 10 years",
            "eligible": false,
            "reason": "Max allowed is 8 years"
          }
        ]
      },

      {
        "section": "80EE",
        "title": "Deduction in respect of interest on loan taken for residential house property",
        "applicability": {
          "eligible_entities": ["Individual"],
          "ineligible_entities": ["HUF", "Firms", "Companies"]
        },
        "conditions": {
          "loan_sanction_period": {
            "start_date": "2016-04-01",
            "end_date": "2017-03-31"
          },
          "loan_amount_limit": 3500000,
          "property_value_limit": 5000000,
          "ownership_condition": "Assessee must not own any residential house on the date of sanction of loan"
        },
        "deduction_details": {
          "type": "Interest on home loan",
          "amount_limit_per_year": 50000,
          "available_from_assessment_year": 2017,
          "continuity": "Allowed for subsequent years until loan interest is paid",
          "exclusion_note": "Deduction not allowed under any other provision for the same interest"
        },
        "definitions": {
          "financial_institution": "Banking company under Banking Regulation Act, 1949, or a housing finance company",
          "housing_finance_company": "Public company in India providing long-term home finance for residential purposes"
        },
        "mode_of_payment": "Interest must be payable to financial institution or housing finance company",
        "examples": [
          {
            "scenario": "Loan sanctioned in May 2016 for ₹30 lakhs, property value ₹45 lakhs, no prior property",
            "eligible": true,
            "reason": "Meets all Section 80EE conditions"
          },
          {
            "scenario": "Loan sanctioned in June 2017",
            "eligible": false,
            "reason": "Sanction date outside eligible window"
          },
          {
            "scenario": "Owns another house before loan sanction",
            "eligible": false,
            "reason": "Ownership condition violated"
          },
          {
            "scenario": "Loan sanctioned for ₹36 lakhs",
            "eligible": false,
            "reason": "Loan amount exceeds limit"
          }
        ]
      },

      {
        "section": "80EEA",
        "title": "Deduction in respect of interest on loan taken for certain house property",
        "applicability": {
          "eligible_entities": ["Individual"],
          "ineligible_entities": ["HUF", "Firms", "Companies"],
          "additional_condition": "Individual not eligible to claim deduction under Section 80EE"
        },
        "conditions": {
          "loan_sanction_period": {
            "start_date": "2019-04-01",
            "end_date": "2022-03-31"
          },
          "stamp_duty_value_limit": 4500000,
          "ownership_condition": "Assessee must not own any residential house on the date of sanction of loan"
        },
        "deduction_details": {
          "type": "Interest on home loan",
          "amount_limit_per_year": 150000,
          "available_from_assessment_year": 2020,
          "continuity": "Allowed for subsequent years until loan interest is paid",
          "exclusion_note": "Deduction not allowed under any other provision for the same interest"
        },
        "definitions": {
          "financial_institution": "Same as defined in Section 80EE",
          "stamp_duty_value": "Value adopted/assessed/assessable by authority for stamp duty purposes"
        },
        "mode_of_payment": "Interest must be payable to financial institution",
        "examples": [
          {
            "scenario": "Loan sanctioned in May 2019 for property with stamp duty value ₹42 lakhs, no prior property",
            "eligible": true,
            "reason": "Meets all Section 80EEA conditions"
          },
          {
            "scenario": "Loan sanctioned in April 2022",
            "eligible": false,
            "reason": "Sanction date outside eligible window"
          },
          {
            "scenario": "Stamp duty value is ₹47 lakhs",
            "eligible": false,
            "reason": "Exceeds stamp duty value limit"
          },
          {
            "scenario": "Already claimed deduction under Section 80EE",
            "eligible": false,
            "reason": "Mutually exclusive with 80EE"
          }
        ]
      },

      {
        "section": "80EEB",
        "title": "Deduction in respect of purchase of electric vehicle",
        "applicability": {
          "eligible_entities": ["Individual"],
          "ineligible_entities": ["HUF", "Firms", "Companies"]
        },
        "conditions": {
          "loan_sanction_period": {
            "start_date": "2019-04-01",
            "end_date": "2023-03-31"
          },
          "purpose": "Loan must be taken from a financial institution for purchase of an electric vehicle"
        },
        "deduction_details": {
          "type": "Interest on loan for electric vehicle",
          "amount_limit_per_year": 150000,
          "available_from_assessment_year": 2020,
          "continuity": "Allowed in subsequent years until interest is fully paid",
          "exclusion_note": "No other deduction for same interest under any provision"
        },
        "definitions": {
          "electric_vehicle": "Vehicle powered exclusively by electric motor using traction battery and regenerative braking system",
          "financial_institution": "Includes banks, deposit-taking NBFCs, and systemically important non-deposit taking NBFCs as per Explanation 4 to section 43B"
        },
        "mode_of_payment": "Interest must be payable to eligible financial institution",
        "examples": [
          {
            "scenario": "Loan sanctioned in Feb 2020 for electric scooter from an NBFC, ₹1.2L interest paid",
            "eligible": true,
            "reason": "All conditions met"
          },
          {
            "scenario": "Loan sanctioned in April 2023",
            "eligible": false,
            "reason": "Sanction date outside permitted window"
          },
          {
            "scenario": "Loan taken for hybrid vehicle",
            "eligible": false,
            "reason": "Only fully electric vehicles allowed"
          }
        ]
      },

      {
        "section": "80G",
        "deduction_in_respect_of_donations": {
          "description": "In computing the total income of an assessee, deductions are allowed in respect of donations made to certain funds, charitable institutions, etc.",
          "subsections": {
            "1": {
              "cases": [
                {
                  "condition": "If the aggregate of the sums specified in sub-section (2) includes any sum or sums of specified nature",
                  "deduction": "100% of the sum or sums of such nature + 50% of the balance of the aggregate"
                },
                {
                  "condition": "In any other case",
                  "deduction": "50% of the aggregate of the sums specified in sub-section (2)"
                }
              ]
            },
            "2": {
              "donation_sums": [
                {
                  "subsection_code": "a",
                  "donation_types": [
                    "National Defence Fund set up by the Central Government",
                    "Prime Minister's Drought Relief Fund",
                    "Prime Minister's National Relief Fund",
                    "PM CARES Fund",
                    "Prime Minister's Armenia Earthquake Relief Fund",
                    "Africa (Public Contributions - India) Fund",
                    "National Children's Fund",
                    "National Foundation for Communal Harmony",
                    "University or educational institution of national eminence",
                    "Maharashtra Chief Minister's Relief Fund",
                    "Gujarat Earthquake Relief Fund",
                    "Zila Saksharta Samiti",
                    "National Blood Transfusion Council",
                    "State Blood Transfusion Council",
                    "State Government Medical Relief Fund",
                    "Army Central Welfare Fund",
                    "Indian Naval Benevolent Fund",
                    "Air Force Central Welfare Fund",
                    "Andhra Pradesh Chief Minister's Cyclone Relief Fund",
                    "National Illness Assistance Fund",
                    "Chief Minister's Relief Fund",
                    "National Sports Fund",
                    "National Cultural Fund",
                    "Fund for Technology Development and Application",
                    "National Trust for Welfare of Persons with Autism, Cerebral Palsy, Mental Retardation",
                    "Swachh Bharat Kosh",
                    "Clean Ganga Fund",
                    "National Fund for Control of Drug Abuse",
                    "Government or local authority for charitable purposes",
                    "Corporations referred to in clause (26BB) of section 10"
                  ]
                },
                {
                  "subsection_code": "b",
                  "description": "Donations for the renovation or repair of places of historic, archaeological, artistic importance, or places of public worship.",
                  "note": "The Government notifies such places in the Official Gazette."
                },
                {
                  "subsection_code": "c",
                  "description": "Donations to the Indian Olympic Association or other specified associations for development of sports infrastructure or sponsorship."
                },
                {
                  "subsection_code": "d",
                  "description": "Donations made to trusts, institutions, or funds for providing relief to the victims of the Gujarat earthquake (26th January 2001 - 30th September 2001)."
                }
              ]
            },
            "3": {
              "status": "Omitted by the Finance Act, 1994, w.e.f. 1-4-1994."
            },
            "4": {
              "limit": "If donations exceed 10% of gross total income, the excess is ignored for the purpose of calculating deductions."
            },
            "5": {
              "conditions_for_institutions_funds": {
                "i": "The institution or fund's income would not be included in its total income under sections 11, 12, or clauses (23AA) or (23C) of section 10, except where the institution derives business income, provided certain conditions are met.",
                "ii": "The instrument under which the institution or fund is constituted does not allow the transfer or application of its income or assets for any non-charitable purpose.",
                "iii": "The institution or fund is not for the benefit of any particular religious community or caste.",
                "iv": "The institution or fund maintains regular accounts.",
                "v": "The institution is constituted as a public charitable trust, registered under applicable laws, or recognized as an educational institution.",
                "vi": "The institution or fund is approved by the Principal Commissioner or Commissioner after 31st March 1992.",
                "vii": "For institutions approved under the previous year beginning 1st April 2007, the approval extends for subsequent periods."
              }
            }
          }
        }
      },

      {
        "section": "80GG",
        "deduction_in_respect_of_rents_paid": {
          "description": "In computing the total income of an assessee, deductions are allowed for expenditure incurred in excess of ten percent of total income towards rent paid for accommodation occupied for personal residence.",
          "conditions": [
            {
              "condition": "Expenditure must be incurred in respect of any furnished or unfurnished accommodation occupied for personal residence.",
              "expenditure_limit": "Excess expenditure should not exceed five thousand rupees per month or twenty-five percent of total income for the year, whichever is less."
            },
            {
              "expenditure_calculation": "Excess expenditure is calculated after deducting 10% of total income."
            },
            {
              "prescribed_conditions": "Other prescribed conditions or limitations, considering the area or place where accommodation is located and other relevant factors, apply."
            }
          ],
          "exclusions": {
            "residential_accommodation_ownership": [
              {
                "condition": "Section does not apply if the accommodation is owned by the assessee or by their spouse or minor child or by a Hindu Undivided Family (HUF) where the assessee resides or performs duties."
              },
              {
                "condition": "Section does not apply if the accommodation is owned by the assessee at any other place and is occupied by the assessee. The value of this accommodation is determined under specific clauses of Section 23."
              }
            ]
          },
          "explanation": {
            "income_calculation": "For the purposes of this section, 'ten percent of total income' and 'twenty-five percent of total income' are calculated before allowing any deductions under this section."
          }
        }
      },

      {
        "section": "80GGC",
        "deduction_in_respect_of_contributions_to_political_parties": {
          "description": "In computing the total income of an assessee, deductions are allowed for contributions made to political parties or electoral trusts, subject to certain conditions.",
          "eligibility": [
            {
              "condition": "Applies to any person except local authority and artificial juridical persons funded wholly or partly by the Government."
            }
          ],
          "conditions": [
            {
              "contribution_limit": "Deduction is allowed for contributions made to a political party or electoral trust in the previous year."
            },
            {
              "cash_exclusion": "No deduction is allowed for contributions made by way of cash."
            }
          ],
          "explanation": {
            "political_party_definition": "For the purposes of this section, 'political party' refers to a political party registered under section 29A of the Representation of the People Act, 1951."
          }
        }
      },

      {
        "section": "80TTA",
        "deduction_in_respect_of_interest_on_savings_account": {
          "description": "In computing the total income of an assessee, a deduction is allowed for interest earned on deposits in savings accounts under specified conditions.",
          "keywords": [
            "Interest", 
            "Savings account", 
            "Banking company", 
            "Co-operative society", 
            "Post Office", 
            "Time deposits", 
            "Deduction", 
            "Maximum limit", 
            "Individual", 
            "HUF"
          ],
          "metadata": {
            "section_number": "80TTA",
            "eligibility_criteria": [
              "Applies to individuals and Hindu undivided families (HUF).",
              "Excludes time deposits (those repayable on expiry of fixed periods)."
            ],
            "deduction_conditions": [
              "Income from savings account interest.",
              "Banking companies, co-operative societies, or Post Office deposits."
            ],
            "limit_conditions": [
              "Income does not exceed ₹10,000 – whole amount eligible.",
              "Income exceeds ₹10,000 – limited to ₹10,000."
            ],
            "exclusions": [
              "Income from savings accounts of firms, AOPs, or BOIs is not eligible for deduction."
            ]
          },
          "eligibility": [
            {
              "condition": "Applies to individuals and Hindu undivided families (HUF)."
            },
            {
              "condition": "Excludes time deposits (those repayable on expiry of fixed periods)."
            }
          ],
          "types_of_deposits": [
            {
              "type": "Banking company",
              "description": "Applies to deposits with banking companies under the Banking Regulation Act, 1949."
            },
            {
              "type": "Co-operative society",
              "description": "Applies to co-operative societies engaged in banking business."
            },
            {
              "type": "Post Office",
              "description": "Applies to savings accounts in a Post Office as defined under the Indian Post Office Act, 1898."
            }
          ],
          "deduction_limits": [
            {
              "case": "Income does not exceed 10,000 rupees",
              "deduction": "Whole of the interest income."
            },
            {
              "case": "Income exceeds 10,000 rupees",
              "deduction": "A maximum of 10,000 rupees."
            }
          ],
          "exclusion": {
            "condition": "No deduction for savings account interest earned by firms, associations of persons, or bodies of individuals."
          },
          "explanation": {
            "time_deposit_definition": "For the purposes of this section, 'time deposits' refers to deposits repayable after fixed periods."
          }
        }
      },

      {
        "section": "80TTB",
        "deduction_in_respect_of_interest_on_deposits_senior_citizens": {
          "description": "In computing the total income of a senior citizen, a deduction is allowed for interest earned on deposits under specified conditions.",
          "keywords": [
            "Interest", 
            "Senior citizen", 
            "Deposits", 
            "Banking company", 
            "Co-operative society", 
            "Post Office", 
            "Time deposits", 
            "Deduction", 
            "Maximum limit", 
            "Firms", 
            "AOP", 
            "BOI"
          ],
          "metadata": {
            "section_number": "80TTB",
            "eligibility_criteria": [
              "Applies to senior citizens, individuals resident in India aged 60 or more.",
              "Excludes time deposits (those repayable on expiry of fixed periods)."
            ],
            "deduction_conditions": [
              "Income from interest on deposits with banks, co-operative societies, or Post Offices."
            ],
            "limit_conditions": [
              "Income does not exceed ₹50,000 – whole amount eligible.",
              "Income exceeds ₹50,000 – limited to ₹50,000."
            ],
            "exclusions": [
              "Income from savings accounts of firms, AOPs, or BOIs is not eligible for deduction."
            ]
          },
          "eligibility": [
            {
              "condition": "Applies to senior citizens, i.e., individuals aged 60 or more during the relevant previous year."
            },
            {
              "condition": "Excludes time deposits (those repayable on expiry of fixed periods)."
            }
          ],
          "types_of_deposits": [
            {
              "type": "Banking company",
              "description": "Applies to deposits with banking companies under the Banking Regulation Act, 1949."
            },
            {
              "type": "Co-operative society",
              "description": "Applies to co-operative societies engaged in banking business."
            },
            {
              "type": "Post Office",
              "description": "Applies to savings accounts in a Post Office as defined under the Indian Post Office Act, 1898."
            }
          ],
          "deduction_limits": [
            {
              "case": "Income does not exceed 50,000 rupees",
              "deduction": "Whole of the interest income."
            },
            {
              "case": "Income exceeds 50,000 rupees",
              "deduction": "A maximum of 50,000 rupees."
            }
          ],
          "exclusion": {
            "condition": "No deduction for savings account interest earned by firms, associations of persons, or bodies of individuals."
          },
          "explanation": {
            "senior_citizen_definition": "For the purposes of this section, a 'senior citizen' means an individual resident in India who is of the age of sixty years or more at any time during the relevant previous year."
          }
        }
      },

      {
        "section": "6",
        "residence_in_india": {
          "description": "This section defines the criteria for determining whether an individual, Hindu Undivided Family (HUF), firm, association of persons (AOP), or company is considered a resident in India for a given previous year.",
          "keywords": [
            "Residence", 
            "India", 
            "Individual", 
            "Hindu Undivided Family", 
            "Firm", 
            "Company", 
            "Taxable income", 
            "Effective management", 
            "Foreign sources", 
            "Non-resident", 
            "Ordinarily resident", 
            "Citizenship"
          ],
          "metadata": {
            "section_number": "6",
            "eligibility_criteria": [
              "Determines residency status based on time spent in India and the control and management of affairs.",
              "Specifies conditions for individuals, HUFs, firms, AOPs, BOIs, and companies."
            ],
            "individual_residency": [
              "Resident if in India for 182 days or more in a year.",
              "Resident if in India for 60 days or more and 365 days in the previous four years."
            ],
            "exceptions_for_individual": [
              "Indian citizens leaving India for employment or as members of crew are treated as residents if they meet the extended stay criteria.",
              "Indian citizens visiting India with income exceeding ₹15 lakh will have different stay criteria."
            ],
            "huf_and_firm_residency": [
              "A Hindu undivided family, firm, or AOP is considered resident unless the control and management of affairs are outside India."
            ],
            "company_residency": [
              "An Indian company is automatically considered a resident.",
              "A company is considered resident if its place of effective management is in India."
            ],
            "not_ordinarly_resident_criteria": [
              "Non-resident for 9 out of 10 previous years or 729 days in the last 7 years.",
              "Income exceeding ₹15 lakh and spent between 120 and 182 days in India qualifies for non-ordinary residency."
            ],
            "income_from_foreign_sources": [
              "Income derived from outside India, excluding business controlled or profession set up in India."
            ]
          },
          "individual_residency_criteria": [
            {
              "condition": "An individual is considered resident if they stay in India for 182 days or more during the year."
            },
            {
              "condition": "An individual is also considered resident if they stay in India for 60 days or more and have been in India for 365 days in the last 4 years."
            }
          ],
          "exceptions": [
            {
              "condition": "Indian citizens leaving India for employment or as crew members are treated as residents if they fulfill extended stay requirements."
            },
            {
              "condition": "Indian citizens visiting India with income exceeding ₹15 lakh have a modified stay requirement of 120-182 days."
            }
          ],
          "huf_and_firm_residency": {
            "condition": "A Hindu undivided family, firm, or AOP is considered resident if its control and management are in India."
          },
          "company_residency_criteria": {
            "condition": "An Indian company is considered resident. If a company's place of effective management is in India, it is considered a resident."
          },
          "not_ordinarly_resident_criteria": [
            {
              "condition": "A non-resident for 9 out of 10 previous years or in India for 729 days or less in the last 7 years qualifies as not ordinarily resident."
            },
            {
              "condition": "An individual with income over ₹15 lakh who stays in India for 120-182 days qualifies as not ordinarily resident."
            }
          ],
          "income_from_foreign_sources_definition": {
            "definition": "Income from foreign sources means income that arises outside India, except income from businesses controlled or professions set up in India."
          }
        }
      },

      {
        "section": "7",
        "income_deemed_to_be_received": {
          "description": "This section defines certain incomes that are deemed to be received by an individual in the previous year, even if the individual has not actually received them. It covers accretion to the balance of recognized provident funds, transferred balances, and contributions under the pension scheme under section 80CCD.",
          "keywords": [
            "Income", 
            "Deemed to be received", 
            "Provident Fund", 
            "Accretion", 
            "Transferred balance", 
            "Pension scheme", 
            "80CCD", 
            "Employee", 
            "Employer", 
            "Central Government", 
            "Recognized provident fund"
          ],
          "metadata": {
            "section_number": "7",
            "deemed_incomes": [
              "Accretion to recognized provident fund balance.",
              "Transferred balance in a recognized provident fund.",
              "Contribution by the Central Government or employer to pension scheme under section 80CCD."
            ],
            "provident_fund_details": [
              "Accretion to balance in a recognized provident fund is deemed to be received.",
              "Transferred balance refers to the balance moved from one provident fund to another."
            ],
            "pension_scheme_contribution": [
              "Contributions made by the Central Government or any other employer to an employee's pension scheme under section 80CCD are deemed to be received."
            ]
          },
          "deemed_incomes": [
            {
              "type": "Provident Fund Accretion",
              "condition": "The annual accretion to the balance in a recognized provident fund is deemed to be received, subject to conditions under rule 6 of Part A of the Fourth Schedule."
            },
            {
              "type": "Transferred Provident Fund Balance",
              "condition": "The transferred balance in a recognized provident fund is deemed to be received, as specified in sub-rule (4) of rule 11 of Part A of the Fourth Schedule."
            },
            {
              "type": "Pension Scheme Contribution",
              "condition": "The contribution made by the Central Government or any other employer to an employee's account under a pension scheme referred to in section 80CCD is deemed to be received."
            }
          ]
        }
      },

      {
        "section": "9",
        "income_deemed_to_accrue_or_arise_in_india": {
          "description": "Section 9 defines situations where income is deemed to accrue or arise in India, even if it is not physically received within the country. It covers various categories of income like income from business or profession, property, and certain specific types of income derived from sources outside India.",
          "keywords": [
            "Income", 
            "Accrue", 
            "Arise", 
            "India", 
            "Deemed income", 
            "Business income", 
            "Property income", 
            "Royalty", 
            "Fees for technical services", 
            "Non-resident", 
            "Income from Indian sources"
          ],
          "metadata": {
            "section_number": "9",
            "deemed_income_sources": [
              "Income from business or profession carried out in India.",
              "Income from property situated in India.",
              "Income from royalties or fees for technical services arising in India."
            ],
            "exclusions": [
              "Income not deemed to accrue or arise in India if not connected to India."
            ]
          },
          "deemed_income_sources": [
            {
              "type": "Business or Profession",
              "condition": "Income from business or profession carried out in India is deemed to accrue or arise in India, irrespective of whether it is received in India or not."
            },
            {
              "type": "Property Income",
              "condition": "Income from property situated in India is deemed to accrue or arise in India."
            },
            {
              "type": "Royalty",
              "condition": "Income from royalties or fees for technical services that arise in India, even if the recipient is a non-resident, is deemed to accrue or arise in India."
            }
          ],
          "exclusions": [
            {
              "type": "Non-Indian Income",
              "condition": "Income that is not connected to India and is earned outside India, or not sourced from Indian property or activities, is not deemed to accrue or arise in India."
            }
          ]
        }
      },

      {
        "section": "15",
        "salaries_income": {
          "description": "Section 15 outlines the types of income that shall be chargeable to income-tax under the head 'Salaries'. It includes any salary due, paid, or allowed by the employer, including arrears, and defines specific provisions for advance payments and salary to partners in a firm.",
          "keywords": [
            "Salaries", 
            "Salary due", 
            "Salary paid", 
            "Arrears of salary", 
            "Bonus", 
            "Commission", 
            "Remuneration", 
            "Advance salary", 
            "Salary of partner", 
            "Income-tax on salary"
          ],
          "metadata": {
            "section_number": "15",
            "chargeable_income_types": [
              "Salary due from employer",
              "Salary paid or allowed before it became due",
              "Arrears of salary",
              "Bonus, commission, or remuneration",
              "Salary paid in advance"
            ],
            "exclusions": [
              "Salary paid to partner of a firm"
            ]
          },
          "chargeable_income": [
            {
              "type": "Salary Due from Employer",
              "condition": "Any salary that is due from an employer or a former employer to the assessee in the previous year, whether paid or not, is chargeable to income-tax."
            },
            {
              "type": "Salary Paid or Allowed in Advance",
              "condition": "Any salary paid or allowed in the previous year by or on behalf of an employer or a former employer, even if it is not due or before it becomes due, is chargeable to income-tax."
            },
            {
              "type": "Arrears of Salary",
              "condition": "Any arrears of salary paid or allowed in the previous year by or on behalf of an employer or a former employer, if it was not charged to income-tax for any earlier previous year, is chargeable to income-tax."
            },
            {
              "type": "Bonus, Commission, or Remuneration",
              "condition": "Any bonus, commission, or remuneration, by whatever name called, that is due to, or received by the assessee in the previous year is chargeable to income-tax under the head 'Salaries'."
            },
            {
              "type": "Salary Paid in Advance",
              "condition": "If any salary is paid in advance and included in the total income for any previous year, it shall not be included again when the salary becomes due."
            }
          ],
          "exclusions": [
            {
              "type": "Salary of Partner",
              "condition": "Any salary, bonus, commission, or remuneration due to or received by a partner of a firm from the firm shall not be regarded as 'salary' for the purposes of Section 15."
            }
          ],
          "detailed_explanation": [
            {
              "type": "Salary Due from Employer",
              "description": "Any salary that is due from the employer or a former employer in the previous year, regardless of whether it has been paid, will be considered chargeable under this section. This applies even if the salary is not yet paid but has been earned and is due."
            },
            {
              "type": "Salary Paid or Allowed in Advance",
              "description": "Salary that is paid or allowed before it becomes due or even though it was not due in the previous year is chargeable to income-tax. This could include prepayments or early salary disbursements."
            },
            {
              "type": "Arrears of Salary",
              "description": "Arrears of salary that were due in earlier years but were not included in those years' income-tax filings are chargeable to income-tax in the year they are paid or allowed."
            },
            {
              "type": "Bonus, Commission, or Remuneration",
              "description": "Any income received under the name of bonus, commission, or remuneration, regardless of how it is named, is included under the head 'Salaries' and is chargeable to income-tax."
            },
            {
              "type": "Salary Paid in Advance",
              "description": "If any salary is paid in advance in one year and included in the total income for that year, it will not be included in the total income again when the salary becomes due in a subsequent year."
            }
          ]
        }
      },

      {
        "section": "16",
        "deductions_from_salaries": {
          "description": "Section 16 outlines the deductions that can be made from an individual's income chargeable under the head 'Salaries' to compute the taxable salary. It includes deductions for certain specified amounts, entertainment allowance, tax on employment, and other allowances granted by the employer.",
          "keywords": [
            "Deductions from salaries", 
            "Salary deductions", 
            "Entertainment allowance", 
            "Tax on employment", 
            "Income-tax deductions", 
            "Salary allowances", 
            "Section 115BAC"
          ],
          "metadata": {
            "section_number": "16",
            "deductions": [
              "Deduction for salary or Rs. 50,000, whichever is less",
              "Deduction for entertainment allowance",
              "Deduction for tax on employment"
            ],
            "provisions": [
              "Finance (No. 2) Act, 2024",
              "Section 115BAC"
            ]
          },
          "deductions": [
            {
              "type": "Deduction for Salary or Rs. 50,000",
              "condition": "A deduction of fifty thousand rupees or the amount of salary, whichever is less, is allowed."
            },
            {
              "type": "Deduction for Entertainment Allowance",
              "condition": "A deduction is allowed in respect of any allowance in the nature of entertainment allowance granted by an employer to an assessee in receipt of a salary from the Government, equal to one-fifth of salary or five thousand rupees, whichever is less."
            },
            {
              "type": "Deduction for Tax on Employment",
              "condition": "A deduction is allowed for any sum paid by the assessee on account of a tax on employment, as levied under Article 276 of the Constitution."
            }
          ],
          "amendment_provision": {
            "provision": "Finance (No. 2) Act, 2024",
            "description": "A new proviso is added by the Finance (No. 2) Act, 2024, effective from 1st April 2025. It increases the deduction limit under clause (ia) of Section 16 from fifty thousand rupees to seventy-five thousand rupees if income-tax is computed under Section 115BAC."
          },
          "detailed_explanation": [
            {
              "type": "Deduction for Salary or Rs. 50,000",
              "description": "This deduction allows an amount up to fifty thousand rupees (or the amount of salary, whichever is less) to be deducted from the total income chargeable under the head 'Salaries'. This deduction ensures that individuals with a relatively low salary have a greater tax relief."
            },
            {
              "type": "Deduction for Entertainment Allowance",
              "description": "This deduction is available only to Government employees receiving entertainment allowance. The deduction is the lesser of one-fifth of their salary (excluding other allowances or benefits) or five thousand rupees."
            },
            {
              "type": "Deduction for Tax on Employment",
              "description": "This allows the assessee to claim a deduction for any sum paid as a tax on employment, as per the provisions of Article 276 of the Indian Constitution, which is a tax levied by state governments on the employment of workers."
            }
          ]
        }
      },

      {
        "salary": {
          "definition": "Salary includes wages, annuities, pensions, gratuities, fees, commissions, perquisites, profits in lieu of salary, advances of salary, payments for leave not availed, contributions to provident funds, government pension contributions, and contributions to the Agniveer Corpus Fund.",
          "items_included": [
            "wages",
            "annuity",
            "pension",
            "gratuity",
            "fees",
            "commissions",
            "perquisites",
            "profits_in_lieu_of_salary",
            "advance_of_salary",
            "payment_for_leave_not_avail",
            "accretion_to_recognised_provident_fund",
            "central_government_pension_contribution",
            "Agniveer_Corpus_Fund_contribution"
          ]
        },
        "perquisite": {
          "definition": "Perquisite includes benefits and amenities provided by the employer to the employee, including rent-free accommodation, accommodations at concessional rates, free or concessional benefits, employer-paid expenses, insurance premiums, specified securities, and sweat equity shares.",
          "items_included": [
            "rent_free_accommodation",
            "concessional_accommodation",
            "free_or_concessional_benefits_or_amenities",
            "employer_paid_obligations",
            "insurance_premium_paid_by_employer",
            "specified_security_or_sweat_equity_shares"
          ],
          "exceptions": [
            "medical_treatment_expenditures_for_employee_or_family",
            "insurance_premiums_under_approved_schemes"
          ]
        },
        "profits_in_lieu_of_salary": {
          "definition": "Profits in lieu of salary include any compensation received upon termination or modification of employment, payments from provident or other funds (excluding employee contributions), and amounts due before or after employment ends.",
          "items_included": [
            "compensation_due_to_termination_or_modification_of_employment",
            "payment_from_provident_fund_or_other_funds_excluding_employee_contributions",
            "Keyman_insurance_policy_payment",
            "payments_due_before_or_after_employment"
          ]
        }
      },

      {
        "section": "115BAC",
        "description": "Tax on income of individuals, Hindu undivided family and others under a specified regime.",
        "applicable_from": "1st April, 2021",
        "tables": [
          {
            "valid_upto": "31st March, 2024",
            "income_brackets": [
              { "range": "Upto Rs. 2,50,000", "tax_rate": "Nil" },
              { "range": "Rs. 2,50,001 to Rs. 5,00,000", "tax_rate": "5%" },
              { "range": "Rs. 5,00,001 to Rs. 7,50,000", "tax_rate": "10%" },
              { "range": "Rs. 7,50,001 to Rs. 10,00,000", "tax_rate": "15%" },
              { "range": "Rs. 10,00,001 to Rs. 12,50,000", "tax_rate": "20%" },
              { "range": "Rs. 12,50,001 to Rs. 15,00,000", "tax_rate": "25%" },
              { "range": "Above Rs. 15,00,000", "tax_rate": "30%" }
            ]
          },
          {
            "valid_from": "1st April, 2024",
            "income_brackets": [
              { "range": "Upto Rs. 3,00,000", "tax_rate": "Nil" },
              { "range": "Rs. 3,00,001 to Rs. 6,00,000", "tax_rate": "5%" },
              { "range": "Rs. 6,00,001 to Rs. 9,00,000", "tax_rate": "10%" },
              { "range": "Rs. 9,00,001 to Rs. 12,00,000", "tax_rate": "15%" },
              { "range": "Rs. 12,00,001 to Rs. 15,00,000", "tax_rate": "20%" },
              { "range": "Above Rs. 15,00,000", "tax_rate": "30%" }
            ]
          },
          {
            "valid_from": "1st April, 2025",
            "income_brackets": [
              { "range": "Upto Rs. 3,00,000", "tax_rate": "Nil" },
              { "range": "Rs. 3,00,001 to Rs. 7,00,000", "tax_rate": "5%" },
              { "range": "Rs. 7,00,001 to Rs. 10,00,000", "tax_rate": "10%" },
              { "range": "Rs. 10,00,001 to Rs. 12,00,000", "tax_rate": "15%" },
              { "range": "Rs. 12,00,001 to Rs. 15,00,000", "tax_rate": "20%" },
              { "range": "Above Rs. 15,00,000", "tax_rate": "30%" }
            ]
          }
        ],
        "conditions": [
          {
            "section": "(1)",
            "description": "Income-tax computation at the specified rates for individual/HUF for the specified assessment years if certain conditions are met."
          },
          {
            "section": "(2)",
            "description": "Computation without exemptions, deductions or set-off of losses from earlier years."
          },
          {
            "section": "(3)",
            "description": "No further deduction for loss or depreciation in subsequent years after full effect in the relevant year."
          },
          {
            "section": "(4)",
            "description": "For a person having a unit in an International Financial Services Centre, specific conditions apply for the availability of section 80LA deductions."
          },
          {
            "section": "(5)",
            "description": "Option must be exercised by a person with business or profession income on or before the due date for the filing of returns."
          },
          {
            "section": "(6)",
            "description": "Once the option is exercised for a previous year, it applies for subsequent years, with specific conditions for withdrawal."
          }
        ],
        "provisions_for_exemption_deduction": {
          "exemptions": [
            "No exemption or deduction under clauses of section 10, 16, 24, and 35AD, etc."
          ],
          "setoff_loss": [
            "No set-off for carried forward losses or depreciation from earlier years."
          ]
        },
        "tax_calculation_instructions": [
          "Total income is computed without exemptions/deductions for specific sections (section 10, section 16, section 24, etc.).",
          "Depreciation and other losses under section 32 and other relevant sections are excluded for tax computation.",
          "Any loss carried forward from house property or any other head cannot be set off."
        ]
      },

      {
        "section": "115BBD",
        "title": "Tax on certain dividends received from foreign companies",
        "subsections": {
          "1": {
            "description": "Where the total income of an assessee, being an Indian company, includes any income by way of dividends declared, distributed or paid by a specified foreign company, the income-tax payable shall be the aggregate of:",
            "items": [
              {
                "clause": "a",
                "text": "The amount of income-tax calculated on the income by way of such dividends, at the rate of fifteen per cent."
              },
              {
                "clause": "b",
                "text": "The amount of income-tax with which the assessee would have been chargeable had its total income been reduced by the aforesaid income by way of dividends."
              }
            ]
          },
          "2": {
            "description": "No deduction in respect of any expenditure or allowance shall be allowed to the assessee under any provision of this Act in computing its income by way of dividends referred to in sub-section (1)."
          },
          "3": {
            "description": "Definitions for this section:",
            "items": [
              {
                "term": "dividends",
                "definition": "Shall have the same meaning as is given to 'dividend' in clause (22) of section 2 but shall not include sub-clause (e) thereof."
              },
              {
                "term": "specified foreign company",
                "definition": "Means a foreign company in which the Indian company holds twenty-six per cent or more in nominal value of the equity share capital of the company."
              }
            ]
          },
          "4": {
            "description": "The provisions of this section shall not apply to any assessment year beginning on or after the 1st day of April, 2023."
          }
        }
      },

      {
        "section": "115BBDA",
        "title": "Tax on certain dividends received from domestic companies",
        "subsections": {
          "1": {
            "description": "Where the total income of a specified assessee, resident in India, includes any income in aggregate exceeding ten lakh rupees, by way of dividends declared, distributed or paid by a domestic company or companies on or before the 31st day of March, 2020, the income-tax payable shall be the aggregate of:",
            "items": [
              {
                "clause": "a",
                "text": "The amount of income-tax calculated on the income by way of such dividends in aggregate exceeding ten lakh rupees, at the rate of ten per cent."
              },
              {
                "clause": "b",
                "text": "The amount of income-tax with which the assessee would have been chargeable had the total income of the assessee been reduced by the amount of income by way of dividends."
              }
            ]
          },
          "2": {
            "description": "No deduction in respect of any expenditure or allowance or set off of loss shall be allowed to the assessee under any provision of this Act in computing the income by way of dividends referred to in clause (a) of sub-section (1)."
          },
          "explanation": {
            "a": {
              "term": "dividend",
              "definition": "Shall have the meaning assigned to it in clause (22) of section 2 but shall not include sub-clause (e) thereof."
            },
            "b": {
              "term": "specified assessee",
              "definition": "Means a person other than:",
              "items": [
                {
                  "subterm": "i",
                  "text": "A domestic company."
                },
                {
                  "subterm": "ii",
                  "text": "A fund or institution or trust or any university or other educational institution or any hospital or other medical institution referred to in sub-clause (iv) or sub-clause (v) or sub-clause (vi) or sub-clause (via) of clause (23C) of section 10."
                },
                {
                  "subterm": "iii",
                  "text": "A trust or institution registered under section 12A or section 12AA or section 12AB."
                }
              ]
            }
          }
        }
      },

      {
        "section": "234A",
        "title": "Interest for Defaults in Furnishing Return of Income",
        "sub_sections": {
          "1": {
            "description": "Interest is payable if the return is filed after the due date or not filed at all.",
            "interest_rate": "1% per month",
            "calculation_period": {
              "start": "Immediately after the due date",
              "end": "Date of furnishing the return or date of completion of assessment (if no return is furnished)"
            },
            "tax_computation": {
              "tax_on_total_income": "Tax on total income as determined under section 143(1), or regular assessment tax after deductions.",
              "deductions": [
                "advance tax",
                "TDS (tax deducted at source)",
                "tax relief under section 89, 90, 90A, 91, 115JAA, 115JD"
              ]
            },
            "explanations": [
              {
                "explanation_number": 1,
                "text": "'Due date' refers to the date specified in sub-section (1) of section 139."
              },
              {
                "explanation_number": 2,
                "sub_explanations": [
                  {
                    "i": "Tax on total income determined under section 143(1) does not include additional income-tax under sections 140B or 143."
                  },
                  {
                    "ii": "Regular assessment tax does not include additional income-tax under section 140B."
                  }
                ]
              },
              {
                "explanation_number": 3,
                "text": "Assessment under sections 147 or 153A is regarded as regular assessment for the purposes of this section."
              }
            ]
          },
          "2": {
            "description": "Interest is reduced by any interest paid under section 140A.",
            "calculation": "The interest paid under section 140A shall be deducted from the total interest payable."
          },
          "3": {
            "description": "Interest is applicable if the return is filed after the notice period under sections 148 or 153A.",
            "interest_rate": "1% per month",
            "calculation_period": {
              "start": "Expiry of time allowed in notice",
              "end": "Date of filing return or date of reassessment completion"
            },
            "tax_computation": {
              "tax_on_total_income": "Tax computed based on reassessment or recomputation"
            }
          },
          "4": {
            "description": "Interest payable is adjusted if reassessment leads to an increase or decrease in tax.",
            "adjustments": {
              "increase_in_tax": "Interest is increased accordingly. A notice of demand will be served.",
              "decrease_in_tax": "Excess interest paid will be refunded."
            }
          },
          "5": {
            "description": "The provisions apply for assessments starting from the assessment year 1989-90 and subsequent years."
          }
        }
      },

      {
        "section": "234B",
        "title": "Interest for defaults in payment of advance tax",
        "subsections": {
          "1": {
            "description": "Where an assessee who is liable to pay advance tax fails to pay such tax or where the advance tax paid is less than 90% of the assessed tax, interest is charged at 1% per month or part of a month from 1st April next following the financial year to the date of determination of total income under section 143 or to the date of regular assessment, whichever is earlier.",
            "calculations": {
              "interest_rate": "1%",
              "period": "From 1st April of the following year to the date of assessment",
              "tax": "Assessed tax or the shortfall in advance tax paid"
            },
            "exemptions": [
              "Tax deducted or collected at source",
              "Relief under sections 89, 90, 90A, 91, 115JAA, 115JD"
            ]
          },
          "2": {
            "description": "If tax is paid by the assessee before the determination of total income or regular assessment, the interest is calculated up to the date of payment and reduced by any interest paid under section 140A.",
            "subsections": {
              "2A": {
                "description": "Where an application under section 245C is made, interest is charged from 1st April of the assessment year until the date of making such application, based on the additional amount of income-tax.",
                "interest_rate": "1%",
                "period": "From 1st April to date of application",
                "tax": "Additional amount of income-tax"
              }
            }
          },
          "3": {
            "description": "Where the shortfall in advance tax is increased due to reassessment under section 147 or 153A, interest is charged from 1st April of the following year to the date of reassessment or recomputation.",
            "interest_rate": "1%",
            "period": "From 1st April to the date of reassessment",
            "tax": "Amount by which the reassessed tax exceeds the original assessment"
          },
          "4": {
            "description": "If the amount of tax on which interest was payable is modified due to an order under section 154, 155, 250, 254, 260, 262, 263, or 264, interest will be recalculated accordingly, and any excess interest paid will be refunded.",
            "subsections": {
              "4A": {
                "action": "Increased interest",
                "procedure": "Notice of demand issued to the assessee"
              },
              "4B": {
                "action": "Reduced interest",
                "procedure": "Excess interest refunded"
              }
            }
          },
          "5": {
            "description": "The provisions apply to assessments for the assessment year commencing on 1st April 1989 and subsequent assessment years."
          }
        }
      },

      {
        "section": "234C",
        "title": "Interest for Deferment of Advance Tax",
        "provisions": {
          "advance_tax_required": {
            "15th_June": "15% of tax due on returned income",
            "15th_September": "45% of tax due on returned income",
            "15th_December": "75% of tax due on returned income",
            "15th_March": "100% of tax due on returned income"
          },
          "interest_for_shortfall": {
            "rate": "1% per month",
            "period": "3 months",
            "shortfall_periods": [
              {
                "date": "15th June",
                "threshold": "15%",
                "penalty_if_not_met": "1% per month on shortfall"
              },
              {
                "date": "15th September",
                "threshold": "45%",
                "penalty_if_not_met": "1% per month on shortfall"
              },
              {
                "date": "15th December",
                "threshold": "75%",
                "penalty_if_not_met": "1% per month on shortfall"
              },
              {
                "date": "15th March",
                "threshold": "100%",
                "penalty_if_not_met": "1% per month on shortfall"
              }
            ]
          },
          "special_cases": {
            "44AD_44ADA_assessees": {
              "applicable_for": "Assessees under section 44AD or 44ADA",
              "penalty": "Interest is charged for the shortfall from the tax due on returned income if advance tax is paid less by 15th March"
            },
            "exceptions": [
              {
                "type": "capital_gains",
                "description": "Shortfall on account of underestimation of capital gains is exempt if paid by 31st March"
              },
              {
                "type": "new_business_income",
                "description": "Shortfall on account of first-time income under 'Profits and gains of business or profession' is exempt if paid by 31st March"
              },
              {
                "type": "dividend_income",
                "description": "Shortfall on account of dividend income is exempt if paid by 31st March"
              }
            ]
          },
          "no_interest_conditions": {
            "15th_June": "No interest if advance tax is at least 12% of tax due",
            "15th_September": "No interest if advance tax is at least 36% of tax due"
          },
          "surcharge_changes": {
            "conditions": "No interest on shortfall caused by increase in surcharge rate, provided the shortfall is paid by 15th March of the following year"
          },
          "explanation": {
            "tax_due_on_returned_income": "The tax chargeable on total income declared in the return, after deducting applicable TDS/TCS, reliefs, and credits"
          }
        },
        "applicability": {
          "assessment_years": "For the assessment year commencing on or after 1st April 1989"
        }
      },

      {
        "section": "234F",
        "title": "Fee for Default in Furnishing Return of Income",
        "provisions": {
          "fee_for_default": {
            "general_fee": "5000 rupees",
            "income_less_than_5_lakh": "1000 rupees"
          },
          "conditions": {
            "applicable_to": "Persons required to furnish a return of income under section 139",
            "time_limit": "Failure to furnish within the prescribed time under section 139(1)",
            "fee_cap": "If total income does not exceed 5 lakh rupees, fee shall not exceed 1000 rupees"
          },
          "applicability": {
            "assessment_years": "For returns required to be furnished for the assessment year commencing on or after 1st April 2018"
          }
        }
      },

      {
        "section": "194",
        "title": "Dividends",
        "provisions": {
          "deduction_of_tax": {
            "applicability": "Before making any payment of dividend or distribution to a shareholder resident in India",
            "rate_of_deduction": "10% income-tax",
            "conditions_for_no_deduction": {
              "individual_shareholder": {
                "payment_mode": "Non-cash",
                "dividend_limit": "Not exceeding 5000 rupees in the financial year"
              }
            }
          },
          "exemptions": {
            "applicable_entities": [
              {
                "entity": "Life Insurance Corporation of India",
                "criteria": "Shares owned by it or in which it has full beneficial interest"
              },
              {
                "entity": "General Insurance Corporation of India",
                "criteria": "Shares owned by it or in which it has full beneficial interest"
              },
              {
                "entity": "Any other insurer",
                "criteria": "Shares owned by it or in which it has full beneficial interest"
              },
              {
                "entity": "Business trust",
                "criteria": "As defined in clause (13A) of section 2"
              },
              {
                "entity": "Other persons",
                "criteria": "As notified by the Central Government in the Official Gazette"
              }
            ]
          }
        }
      },

      {
        "section": "194A",
        "title": "Interest other than 'Interest on securities'",
        "provisions": {
          "deduction_of_tax": {
            "applicability": "At the time of credit of income or at the time of payment, whichever is earlier",
            "rate_of_deduction": "Rates in force",
            "liable_entities": [
              "Person not being an individual or HUF",
              "Individual or Hindu Undivided Family whose business or profession turnover exceeds specified limits"
            ]
          },
          "exemptions": {
            "amount_limit": {
              "banking_companies": "40,000 rupees",
              "cooperative_societies_banking": "40,000 rupees",
              "post_office_deposits": "40,000 rupees",
              "others": "5,000 rupees"
            },
            "senior_citizen_limit": {
              "applicable_amount": "50,000 rupees"
            },
            "exceptions": [
              "Income credited or paid to banking companies or co-operative societies engaged in banking",
              "Income credited or paid to financial corporations, Life Insurance Corporation of India, Unit Trust of India, insurance companies, or other notified institutions",
              "Income credited or paid by a firm to a partner",
              "Income credited or paid by a co-operative society to its members or other co-operative societies",
              "Income from time deposits or other specified deposit schemes"
            ]
          },
          "adjustments": {
            "excess_or_deficiency": "Adjustment of excess or deficiency in previous deductions during the financial year"
          },
          "government_notifications": {
            "lower_rate": "The Central Government may notify lower rates for specific persons or classes"
          }
        }
      },

      {
        "section": "194BA",
        "title": "Winnings from online games",
        "provisions": {
          "deduction_of_tax": {
            "applicability": "At the end of the financial year or at the time of withdrawal from user account, whichever is earlier",
            "calculation_of_tax": "Net winnings in the user account, computed as per prescribed manner",
            "rate_of_deduction": "Rates in force",
            "condition_for_withdrawals": "Tax shall be deducted on net winnings at the time of withdrawal, including remaining amount in user account"
          },
          "in_kind_winnings": {
            "description": "If winnings are partly in cash and partly in kind, tax must be paid before releasing the winnings if the cash amount is insufficient to cover the tax liability"
          },
          "difficulty_removal_guidelines": {
            "board_guidelines": "In case of difficulties, the Board may issue guidelines, with prior approval from the Central Government"
          },
          "guidelines_procedure": {
            "parliament_approval": "Every guideline issued by the Board shall be laid before Parliament and be binding on authorities and liable person"
          },
          "definitions": {
            "computer_resource": "As defined in section 115BBJ",
            "internet": "As defined in section 115BBJ",
            "online_game": "As defined in section 115BBJ",
            "online_gaming_intermediary": "An intermediary that offers one or more online games",
            "user": "Any person who accesses or avails any computer resource of an online gaming intermediary",
            "user_account": "Account of a user registered with an online gaming intermediary"
          }
        }
      },

      {
        "section": "194C",
        "title": "Payments to contractors",
        "provisions": {
          "deduction_of_tax": {
            "applicability": "At the time of credit of sum to contractor's account or at the time of payment (whichever is earlier)",
            "tax_rate": {
              "individual_huf": "1%",
              "others": "2%"
            },
            "applicability_conditions": {
              "crediting_to_account": "Tax applies when credited to contractor’s account",
              "payment_modes": "Cash, cheque, draft, or any other mode"
            }
          },
          "crediting_to_suspense_account": {
            "description": "If sum is credited to a suspense account, it is deemed credited to the contractor’s account, and tax deduction provisions apply"
          },
          "tax_on_invoice_value": {
            "work_specified_in_explanation": {
              "tax_deduction_rules": {
                "if_material_value_separated": "Deduct tax on invoice value excluding material cost",
                "if_material_value_not_separated": "Deduct tax on the whole invoice value"
              }
            }
          },
          "personal_purposes_exemption": {
            "applicability": "No tax deduction for sums credited or paid for personal purposes of individual or Hindu undivided family"
          },
          "threshold_for_deduction": {
            "amount_limit": "No tax deduction if the sum does not exceed ₹30,000, unless aggregate exceeds ₹1,00,000 during the financial year"
          },
          "goods_carriage_exemption": {
            "applicability": "No tax deduction for contractors owning 10 or fewer goods carriages and providing declaration with PAN"
          },
          "reporting_requirements": {
            "for_goods_carriage_contractors": "The person responsible for payment must furnish details to the prescribed income-tax authority"
          },
          "definitions": {
            "specified_person": {
              "entities_included": [
                "Central Government",
                "State Government",
                "Local authorities",
                "Corporations established by Central, State, or Provincial Acts",
                "Companies",
                "Co-operative societies",
                "Housing and planning authorities",
                "Registered societies",
                "Trusts",
                "Universities",
                "Foreign Governments or enterprises",
                "Firms",
                "Individuals/HUF with sales exceeding ₹1 crore or profession exceeding ₹50 lakh"
              ]
            },
            "goods_carriage": "As defined in section 44AE",
            "contract": "Includes sub-contract",
            "work_includes": [
              "Advertising",
              "Broadcasting/telecasting",
              "Carriage of goods/passengers (other than by railways)",
              "Catering",
              "Manufacturing or supplying a product according to customer’s specifications"
            ],
            "work_exclusions": [
              "Manufacturing or supplying products using material not purchased from the customer or their associate",
              "Any sum mentioned in section 194J"
            ]
          }
        }
      },

      {
        "section": "194-I",
        "title": "Rent",
        "provisions": {
          "deduction_of_tax": {
            "applicability": "At the time of credit of income to payee's account or at the time of payment (whichever is earlier)",
            "tax_rate": {
              "machinery_plant_equipment": "2%",
              "land_building_furniture_fittings": "10%"
            },
            "exemption_threshold": {
              "individual_huf_exemption": "No deduction if the total income credited or paid does not exceed ₹240,000 during the financial year",
              "business_exemption": "No deduction if the individual/HUF's turnover exceeds ₹1 crore for business or ₹50 lakh for profession in the preceding financial year"
            },
            "business_trust_exemption": "No deduction if the rent is paid to a business trust (REIT) for real estate assets owned directly by the trust, as per section 10(23FCA)"
          },
          "definitions": {
            "rent": {
              "description": "Any payment made for the use of (either separately or together) any land, building (including factory building), land appurtenant to a building (including factory building), machinery, plant, equipment, furniture, or fittings, under any lease, sub-lease, tenancy, or any other agreement"
            },
            "crediting_to_suspense_account": {
              "description": "If income is credited to any suspense account, it is considered credited to the payee's account, and tax deduction provisions apply"
            }
          }
        }
      },

      {
        "section": "194J",
        "title": "Fees for Professional or Technical Services",
        "provisions": {
          "deduction_of_tax": {
            "applicability": "At the time of credit of sum to the payee's account or at the time of payment (whichever is earlier)",
            "tax_rate": {
              "technical_services": "2%",
              "royalty_cinematographic_films": "2%",
              "other_cases": "10%"
            },
            "exemption_threshold": {
              "professional_services": "No deduction if sum does not exceed ₹30,000 for professional services",
              "technical_services": "No deduction if sum does not exceed ₹30,000 for technical services",
              "royalty": "No deduction if sum does not exceed ₹30,000 for royalty",
              "other_sums": "No deduction if sum does not exceed ₹30,000 for any other sum referred to in clause (d) of section 28"
            },
            "business_trust_exemption": "No deduction for individual/HUF if total sales or turnover exceed ₹1 crore for business or ₹50 lakh for profession in the preceding financial year",
            "personal_purpose_exemption": "No deduction if fees are paid exclusively for personal purposes of individual/HUF"
          },
          "special_conditions": {
            "call_center": "For payee engaged only in the business of operation of a call center, tax rate is 2% instead of 10%"
          },
          "definitions": {
            "professional_services": {
              "description": "Services rendered by persons in professions like legal, medical, engineering, architectural, accountancy, technical consultancy, interior decoration, advertising, or any other profession notified by the Board"
            },
            "fees_for_technical_services": {
              "description": "Has the same meaning as in Explanation 2 to clause (vii) of sub-section (1) of section 9"
            },
            "royalty": {
              "description": "Has the same meaning as in Explanation 2 to clause (vi) of sub-section (1) of section 9"
            },
            "crediting_to_suspense_account": {
              "description": "If sum is credited to any suspense account or other accounts, it is considered credited to the payee's account, and the tax deduction provisions apply"
            }
          }
        }
      },

      {
        "section": "139",
        "title": "Return of Income",
        "subsections": [
          {
            "subsection": "139(1)",
            "title": "Mandatory Filing",
            "description": "Specifies who is required to mandatorily file their income tax return based on income thresholds and other conditions."
          },
          {
            "subsection": "139(4)",
            "title": "Belated Return",
            "description": "Allows filing of a belated return if the original due date is missed, subject to time limits and late filing fees."
          },
          {
            "subsection": "139(5)",
            "title": "Revised Return",
            "description": "Permits revision of a previously filed return to correct any omission or wrong statement, within the prescribed time."
          },
          {
            "subsection": "139(8A)",
            "title": "Updated Return",
            "description": "Enables filing of an updated return within 24 months from the end of the relevant assessment year, with additional tax liability."
          },
          {
            "subsection": "139(9)",
            "title": "Defective Return",
            "description": "Specifies conditions under which a return is treated as defective and the process to rectify such defects within a time frame."
          }
        ]
      },

      {
        "section": "140",
        "title": "Return by whom to be verified",
        "description": "Specifies who is authorized to verify the return of income under Section 115WD or Section 139, based on the type of taxpayer.",
        "verification_by_entity": [
          {
            "entity": "Individual",
            "verification_by": [
              "The individual himself",
              "If absent from India – by the individual or duly authorized person with power of attorney",
              "If mentally incapacitated – by guardian or competent person",
              "If otherwise unable – by a duly authorized person with power of attorney"
            ]
          },
          {
            "entity": "Hindu Undivided Family (HUF)",
            "verification_by": [
              "Karta",
              "If Karta is absent or mentally incapacitated – any other adult member"
            ]
          },
          {
            "entity": "Company",
            "verification_by": [
              "Managing Director",
              "If unavailable – any director or prescribed person",
              "If company is non-resident – person holding valid power of attorney (attached with return)",
              "If under liquidation – liquidator (u/s 178)",
              "If under government control – principal officer",
              "If under IBC proceedings – insolvency professional"
            ]
          },
          {
            "entity": "Firm",
            "verification_by": [
              "Managing Partner",
              "If unavailable – any other partner (not a minor)"
            ]
          },
          {
            "entity": "Limited Liability Partnership (LLP)",
            "verification_by": [
              "Designated Partner",
              "If unavailable – any partner or prescribed person"
            ]
          },
          {
            "entity": "Local Authority",
            "verification_by": [
              "Principal Officer"
            ]
          },
          {
            "entity": "Political Party (u/s 139(4B))",
            "verification_by": [
              "Chief Executive Officer (by any name/designation)"
            ]
          },
          {
            "entity": "Association of Persons",
            "verification_by": [
              "Any member or principal officer"
            ]
          },
          {
            "entity": "Other Persons",
            "verification_by": [
              "That person or a competent person acting on their behalf"
            ]
          }
        ]
      },

      {
        "section": "143",
        "title": "Assessment",
        "subsections": {
          "(1)": {
            "title": "Processing of Return",
            "clauses": {
              "(a)": {
                "title": "Computation of total income or loss",
                "subclauses": {
                  "(i)": "Any arithmetical error in the return",
                  "(ii)": "An incorrect claim, if such incorrect claim is apparent from any information in the return",
                  "(iii)": "Disallowance of loss claimed due to late filing of return for previous year",
                  "(iv)": "Disallowance of expenditure or increase in income as per audit report not considered in return",
                  "(v)": "Disallowance of deduction under section 10AA or Chapter VI-A for late returns",
                  "(vi)": "Addition of income from Form 26AS/Form 16A/Form 16 not included in return"
                },
                "provisos": [
                  "No such adjustments unless intimation is given to assessee",
                  "Consider response from assessee before adjustment",
                  "No adjustment under (vi) for AY from 1 April 2018"
                ]
              },
              "(b)": "Computation of tax, interest, and fee based on (a)",
              "(c)": "Determine payable or refundable amount after adjustments",
              "(d)": "Preparation and sending of intimation to assessee",
              "(e)": "Refund to assessee, if any",
              "provisos": [
                "Intimation required if loss adjusted but no tax/refund",
                "No intimation after 9 months from end of FY in which return is made"
              ],
              "explanation": {
                "(a)": {
                  "definition": "Incorrect claim apparent from information in return",
                  "subpoints": {
                    "(i)": "Item inconsistent with another item in return",
                    "(ii)": "Information to support claim not furnished",
                    "(iii)": "Deduction exceeds specified statutory limit"
                  }
                },
                "(b)": "Acknowledgement deemed intimation if no tax/refund and no adjustment"
              }
            }
          },
          "(1A)": "Scheme for centralized processing of returns by Board",
          "(1B)": "Govt. may notify exceptions/modifications to provisions for centralized processing",
          "(1C)": "Notification and scheme to be laid before Parliament",
          "(1D)": {
            "rule": "Processing not necessary if notice under (2) issued",
            "proviso": "Not applicable to returns from AY 1 April 2017 onwards"
          },
          "(2)": {
            "title": "Notice for scrutiny",
            "rule": "AO may serve notice requiring evidence",
            "proviso": "No notice after 3 months from end of FY in which return is furnished"
          },
          "(3)": {
            "title": "Assessment order after notice under (2)",
            "rule": "AO assesses income/loss and determines tax/refund",
            "provisos": [
              {
                "entities": [
                  "research association (10(21))",
                  "news agency (10(22B))",
                  "association/institution (10(23A))",
                  "institution (10(23B))"
                ],
                "condition": "No assessment unless Govt. informed and approval withdrawn or notification rescinded"
              },
              {
                "entities": [
                  "fund/institution (10(23C)(iv))",
                  "trust/institution (10(23C)(v))",
                  "university/educational institution (10(23C)(vi))",
                  "hospital/medical institution (10(23C)(via))",
                  "trust/institution (11)"
                ],
                "condition": "No assessment without withdrawal order from Principal Commissioner or Commissioner"
              },
              {
                "condition": "If university/college/institution under 35(1)(ii)/(iii) violates conditions, Govt. may withdraw approval"
              }
            ]
          },
          "(3A)": {
            "title": "Govt. may notify scheme for assessment under (3) or 144",
            "objectives": [
              "Eliminate interface using technology",
              "Optimize resources via scale and specialization",
              "Introduce team-based assessment with dynamic jurisdiction"
            ]
          }
        }
      },

      {
        "section": "144",
        "title": "Best Judgment Assessment",
        "subsections": {
          "(1)": {
            "conditions": {
              "(a)": "Fails to file return under section 139(1) and has not filed a return under 139(4), 139(5), or updated return under 139(8A)",
              "(b)": "Fails to comply with notice under section 142(1) or direction under section 142(2A)",
              "(c)": "Fails to comply with notice under section 143(2) despite having filed return"
            },
            "action": "Assessing Officer shall assess income/loss to the best of their judgment after considering all relevant materials and giving the assessee an opportunity of being heard",
            "provisos": [
              "AO shall serve a notice specifying date and time for hearing before making best judgment assessment",
              "No need to provide such opportunity if a notice under section 142(1) was already issued before making the assessment"
            ]
          },
          "(2)": {
            "rule": "Pre-1988 law applies to assessment year 1988–89 and earlier",
            "note": "References to other provisions should align with the version of the law applicable to the relevant year"
          }
        }
      }
      ]}]
      